qmckl_jastrow.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-17 Wed 11:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Jastrow Factor</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="TREX CoE" />
<link rel="stylesheet" title="Standard" href="qmckl.css" type="text/css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Jastrow Factor</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3afd88c">1. Introduction</a></li>
<li><a href="#orge187fdf">2. Context</a>
<ul>
<li><a href="#orgf2e88b2">2.1. Data structure</a></li>
<li><a href="#org4421665">2.2. Access functions</a></li>
<li><a href="#org99b634a">2.3. Initialization functions</a></li>
<li><a href="#org2ed9630">2.4. Test</a></li>
</ul>
</li>
<li><a href="#org7736ec5">3. Computation</a>
<ul>
<li><a href="#orgfd671d4">3.1. Asymptotic component for \(J_{ee}\)</a>
<ul>
<li><a href="#org3edfe94">3.1.1. Get</a></li>
<li><a href="#org37a9168">3.1.2. Compute</a></li>
<li><a href="#org2c4b87c">3.1.3. Test</a></li>
</ul>
</li>
<li><a href="#org3abd10e">3.2. Electron-electron component \(f_{ee}\)</a>
<ul>
<li><a href="#orgf106a61">3.2.1. Get</a></li>
<li><a href="#org6914b0f">3.2.2. Compute</a></li>
<li><a href="#orgbebc7c5">3.2.3. Test</a></li>
</ul>
</li>
<li><a href="#org513c2f9">3.3. Electron-electron component derivative \(f'_{ee}\)</a>
<ul>
<li><a href="#orgd83e65b">3.3.1. Get</a></li>
<li><a href="#org5379d75">3.3.2. Compute</a></li>
<li><a href="#org9d46ccb">3.3.3. Test</a></li>
</ul>
</li>
<li><a href="#org08670d6">3.4. Electron-nucleus component \(f_{en}\)</a>
<ul>
<li><a href="#orgd6aff7b">3.4.1. Get</a></li>
<li><a href="#orge1dfa88">3.4.2. Compute</a></li>
<li><a href="#org3b1f6f9">3.4.3. Test</a></li>
</ul>
</li>
<li><a href="#org70afcca">3.5. Electron-nucleus component derivative \(f'_{en}\)</a>
<ul>
<li><a href="#org87ccb6b">3.5.1. Get</a></li>
<li><a href="#org17ad45c">3.5.2. Compute</a></li>
<li><a href="#orgc456aea">3.5.3. Test</a></li>
</ul>
</li>
<li><a href="#orgbaf2c92">3.6. Electron-electron rescaled distances for each order</a>
<ul>
<li><a href="#org44b4ac0">3.6.1. Get</a></li>
<li><a href="#orgece93bd">3.6.2. Compute</a></li>
<li><a href="#orgadb9fbc">3.6.3. Test</a></li>
</ul>
</li>
<li><a href="#org982d851">3.7. Electron-electron rescaled distances for each order and derivatives</a>
<ul>
<li><a href="#org0b571ac">3.7.1. Get</a></li>
<li><a href="#org079e0d8">3.7.2. Compute</a></li>
<li><a href="#orgf767459">3.7.3. Test</a></li>
</ul>
</li>
<li><a href="#org2d7a0b3">3.8. Electron-nucleus rescaled distances for each order</a>
<ul>
<li><a href="#org8e59b10">3.8.1. Get</a></li>
<li><a href="#org479d65a">3.8.2. Compute</a></li>
<li><a href="#orgd3bd3f9">3.8.3. Test</a></li>
</ul>
</li>
<li><a href="#org18bd3a0">3.9. Electron-nucleus rescaled distances for each order and derivatives</a>
<ul>
<li><a href="#orgc4ad078">3.9.1. Get</a></li>
<li><a href="#org4361d3b">3.9.2. Compute</a></li>
<li><a href="#orgc91cb54">3.9.3. Test</a></li>
</ul>
</li>
<li><a href="#org38c0d6c">3.10. Prepare for electron-electron-nucleus Jastrow \(f_{een}\)</a>
<ul>
<li><a href="#orgafb5fc7">3.10.1. Get</a></li>
<li><a href="#org2f92629">3.10.2. Compute dim<sub>cord</sub><sub>vect</sub></a></li>
<li><a href="#orgc549830">3.10.3. Compute cord<sub>vect</sub><sub>full</sub></a></li>
<li><a href="#org21061e6">3.10.4. Compute lkpm<sub>combined</sub><sub>index</sub></a></li>
<li><a href="#orgea62dad">3.10.5. Compute tmp<sub>c</sub></a></li>
<li><a href="#org16f384f">3.10.6. Compute dtmp<sub>c</sub></a></li>
<li><a href="#org6d3ab02">3.10.7. Test</a></li>
</ul>
</li>
<li><a href="#org96a9c18">3.11. Electron-electron-nucleus Jastrow \(f_{een}\)</a>
<ul>
<li><a href="#org0180d6c">3.11.1. Get</a></li>
<li><a href="#org6c6d75c">3.11.2. Compute naive</a></li>
<li><a href="#orgcf442f7">3.11.3. Compute</a></li>
<li><a href="#org63f08c1">3.11.4. Test</a></li>
</ul>
</li>
<li><a href="#org322ba20">3.12. Electron-electron-nucleus Jastrow \(f_{een}\) derivative</a>
<ul>
<li><a href="#orgea9871d">3.12.1. Get</a></li>
<li><a href="#org3564e43">3.12.2. Compute Naive</a></li>
<li><a href="#org0c53c8a">3.12.3. Compute</a></li>
<li><a href="#org0cf3fda">3.12.4. Test</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3afd88c" class="outline-2">
<h2 id="org3afd88c"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
The Jastrow factor depends on the electronic (\(\mathbf{r}\)) and
nuclear (\(\mathbf{R}\)) coordinates. Its defined as \(\exp(J(\mathbf{r},\mathbf{R}))\), where
</p>

<p>
\[
  J(\mathbf{r},\mathbf{R}) = J_{\text{eN}}(\mathbf{r},\mathbf{R}) + J_{\text{ee}}(\mathbf{r}) + J_{\text{eeN}}(\mathbf{r},\mathbf{R})
  \]
</p>

<p>
In the following, we us the notations \(r_{ij} = |\mathbf{r}_i - \mathbf{r}_j|\) and
\(R_{i\alpha} = |\mathbf{r}_i - \mathbf{R}_\alpha|\).
</p>

<p>
\(J_{\text{eN}}\) contains electron-nucleus  terms:
</p>

<p>
\[
  J_{\text{eN}}(\mathbf{r},\mathbf{R}) = \sum_{i=1}^{N_\text{elec}} \sum_{\alpha=1}^{N_\text{nucl}}
  \frac{a_1\, f(R_{i\alpha})}{1+a_2\, f(R_{i\alpha})} +
  \sum_{p=2}^{N_\text{ord}^a} a_{p+1}\, [f(R_{i\alpha})]^p - J_{eN}^\infty
  \]
</p>

<p>
\(J_{\text{ee}}\) contains electron-electron terms:
\[
  J_{\text{ee}}(\mathbf{r}) =
  \sum_{i=1}^{N_\text{elec}} \sum_{j=1}^{i-1}
  \frac{b_1\, f(r_{ij})}{1+b_2\, f(r_{ij})} +
  \sum_{p=2}^{N_\text{ord}^b} a_{p+1}\, [f(r_{ij})]^p  - J_{ee}^\infty
  \]
</p>

<p>
and \(J_{\text{eeN}}\) contains electron-electron-Nucleus terms:
</p>

<p>
\[
  J_{\text{eeN}}(\mathbf{r},\mathbf{R}) =
   \sum_{\alpha=1}^{N_{\text{nucl}}}
    \sum_{i=1}^{N_{\text{elec}}}
     \sum_{j=1}^{i-1}
      \sum_{p=2}^{N_{\text{ord}}}
       \sum_{k=0}^{p-1}
        \sum_{l=0}^{p-k-2\delta_{k,0}}
          c_{lkp\alpha} \left[ g({r}_{ij}) \right]^k
            \left[ \left[ g({R}_{i\alpha}) \right]^l + \left[ g({R}_{j\alpha}) \right]^l \right]
            \left[ g({R}_{i\,\alpha}) \, g({R}_{j\alpha}) \right]^{(p-k-l)/2}
  \]
</p>

<p>
\(c_{lkp\alpha}\) are non-zero only when \(p-k-l\) is even.
</p>

<p>
\(f\) and \(g\) are scaling function defined as
</p>

<p>
\[
  f(r) = \frac{1-e^{-\kappa\, r}}{\kappa} \text{ and }
  g(r) = e^{-\kappa\, r}.
  \]
</p>

<p>
The terms \(J_{\text{ee}}^\infty\) and \(J_{\text{eN}}^\infty\) are shifts to ensure that
\(J_{\text{ee}}\) and \(J_{\text{eN}}\) have an asymptotic value of zero.
</p>
</div>
</div>
