org/qmckl_jastrow.org
* Context
   :PROPERTIES:
   :Name:     qmckl_jastrow
   :CRetType: qmckl_exit_code
   :FRetType: qmckl_exit_code
   :END:

  The following data stored in the context:

  #+NAME: qmckl_jastrow_args
    | Variable                  | Type                                  | In/Out | Description                                                       |
    |---------------------------+---------------------------------------+--------+-------------------------------------------------------------------|
    | ~uninitialized~           | ~int32_t~                             | in     | Keeps bits set for uninitialized data                             |
    | ~aord_num~                | ~int64_t~                             | in     | The number of a coeffecients                                      |
    | ~bord_num~                | ~int64_t~                             | in     | The number of b coeffecients                                      |
    | ~cord_num~                | ~int64_t~                             | in     | The number of c coeffecients                                      |
    | ~type_nucl_num~           | ~int64_t~                             | in     | Number of Nucleii types                                           |
    | ~type_nucl_vector~        | ~int64_t[nucl_num]~                   | in     | IDs of types of Nucleii                                           |
    | ~aord_vector~             | ~double[aord_num + 1][type_nucl_num]~ | in     | Order of a polynomial coefficients                                |
    | ~bord_vector~             | ~double[bord_num + 1]~                | in     | Order of b polynomial coefficients                                |
    | ~cord_vector~             | ~double[cord_num][type_nucl_num]~     | in     | Order of c polynomial coefficients                                |
    | ~factor_ee~               | ~double[walk_num]~                    | out    | Jastrow factor: electron-electron part                            |
    | ~factor_ee_date~          | ~uint64_t~                            | out    | Jastrow factor: electron-electron part                            |
    | ~factor_en~               | ~double[walk_num]~                    | out    | Jastrow factor: electron-nucleus  part                            |
    | ~factor_en_date~          | ~uint64_t~                            | out    | Jastrow factor: electron-nucleus  part                            |
    | ~factor_een~              | ~double[walk_num]~                    | out    | Jastrow factor: electron-electron-nucleus  part                   |
    | ~factor_een_date~         | ~uint64_t~                            | out    | Jastrow factor: electron-electron-nucleus  part                   |
    | ~factor_ee_deriv_e~       | ~double[4][nelec][walk_num]~          | out    | Derivative of the Jastrow factor: electron-electron-nucleus  part |
    | ~factor_ee_deriv_e_date~  | ~uint64_t~                            | out    | Keep track of the date for the derivative                         |
    | ~factor_en_deriv_e~       | ~double[4][nelec][walk_num]~          | out    | Derivative of the Jastrow factor: electron-electron-nucleus  part |
    | ~factor_en_deriv_e_date~  | ~uint64_t~                            | out    | Keep track of the date for the en derivative                      |
    | ~factor_een_deriv_e~      | ~double[4][nelec][walk_num]~          | out    | Derivative of the Jastrow factor: electron-electron-nucleus  part |
    | ~factor_een_deriv_e_date~ | ~uint64_t~                            | out    | Keep track of the date for the een derivative                     |

  computed data:

    | Variable                   | Type                                                            | In/Out                                          |
    |----------------------------+-----------------------------------------------------------------+-------------------------------------------------|
    | ~dim_cord_vect~            | ~int64_t~                                                       | Number of unique C coefficients                 |
    | ~dim_cord_vect_date~       | ~uint64_t~                                                      | Number of unique C coefficients                 |
    | ~asymp_jasb~               | ~double[2]~                                                     | Asymptotic component                            |
    | ~asymp_jasb_date~          | ~uint64_t~                                                      | Asymptotic component                            |
    | ~cord_vect_full~           | ~double[dim_cord_vect][nucl_num]~                               | vector of non-zero coefficients                 |
    | ~cord_vect_full_date~      | ~uint64_t~                                                      | Keep track of changes here                      |
    | ~lkpm_combined_index~      | ~int64_t[4][dim_cord_vect]~                                     | Transform l,k,p, and m into consecutive indices |
    | ~lkpm_combined_index_date~ | ~uint64_t~                                                      | Transform l,k,p, and m into consecutive indices |
    | ~tmp_c~                    | ~double[walk_num][cord_num][cord_num+1][nucl_num][elec_num]~    | vector of non-zero coefficients                 |
    | ~dtmp_c~                   | ~double[walk_num][elec_num][4][nucl_num][cord_num+1][cord_num]~ | vector of non-zero coefficients                 |

    | ~een_rescaled_n~              | ~double[walk_num][cord_num+1][nucl_num][elec_num]~  | The electron-electron rescaled distances raised to the powers defined by cord                           |
    | ~een_rescaled_n_date~         | ~uint64_t~                                            | Keep track of the date of creation                                                                      |
    | ~een_rescaled_e_deriv_e~      | ~double[walk_num][cord_num+1][elec_num][4][elec_num]~ | The electron-electron rescaled distances raised to the powers defined by cord derivatives wrt electrons |
    | ~een_rescaled_e_deriv_e_date~ | ~uint64_t~                                            | Keep track of the date of creation                                                                      |
    | ~een_rescaled_n_deriv_e~      | ~double[walk_num][cord_num+1][nucl_num][4][elec_num]~ | The electron-electron rescaled distances raised to the powers defined by cord derivatives wrt electrons |
    | ~een_rescaled_n_deriv_e_date~ | ~uint64_t~                                            | Keep track of the date of creation                                                                      |

   #+NAME: jastrow_data
   #+BEGIN_SRC python :results none :exports none
import numpy as np

# For H2O we have the following data:
elec_num     = 10
nucl_num     = 2
up_num       = 5
down_num     = 5
nucl_coord = np.array([ [0.000000,  0.000000 ],
   [0.000000,  0.000000 ],
   [0.000000,  2.059801 ] ])

elec_coord =    [[[-0.250655104764153      ,  0.503070975550133      ,  -0.166554344502303],
     [-0.587812193472177      , -0.128751981129274      ,   0.187773606533075],
     [ 1.61335569047166       , -0.615556732874863      ,  -1.43165470979934 ],
     [-4.901239896295210E-003 , -1.120440036458986E-002 ,   1.99761909330422 ],
     [ 0.766647499681200      , -0.293515395797937      ,   3.66454589201239 ],
     [-0.127732483187947      , -0.138975497694196      ,  -8.669850480215846E-002],
     [-0.232271834949124      , -1.059321673434182E-002 ,  -0.504862241464867],
     [ 1.09360863531826       , -2.036103063808752E-003 ,  -2.702796910818986E-002],
     [-0.108090166832043      ,  0.189161729653261      ,   2.15398313919894],
     [ 0.397978144318712      , -0.254277292595981      ,   2.54553335476344]]];

ee_distance_rescaled = [
[ 0.000000000000000, 0.000000000000000, 0.000000000000000,
  0.000000000000000, 0.000000000000000, 0.000000000000000,
  0.000000000000000, 0.000000000000000, 0.000000000000000,
  0.000000000000000 ],
[ 0.550227800352402, 0.000000000000000, 0.000000000000000,
  0.000000000000000, 0.000000000000000, 0.000000000000000,
  0.000000000000000, 0.000000000000000, 0.000000000000000,
  0.000000000000000 ],
[ 0.919155060185168, 0.937695909123175, 0.000000000000000,
  0.000000000000000, 0.000000000000000, 0.000000000000000,
  0.000000000000000, 0.000000000000000, 0.000000000000000,
  0.000000000000000 ],
[ 0.893325429242815, 0.851181978173561, 0.978501685226877,
  0.000000000000000, 0.000000000000000, 0.000000000000000,
  0.000000000000000, 0.000000000000000, 0.000000000000000,
  0.000000000000000 ],
[ 0.982457268305353, 0.976125002619471, 0.994349933143149,
  0.844077311588328, 0.000000000000000, 0.000000000000000,
  0.000000000000000, 0.000000000000000, 0.000000000000000,
  0.000000000000000 ],
[ 0.482407528408731, 0.414816073699124, 0.894716035479343,
  0.876540187084407, 0.978921170036895, 0.000000000000000,
  0.000000000000000, 0.000000000000000, 0.000000000000000,
  0.000000000000000 ],
[ 0.459541909660400, 0.545007215761510, 0.883752955884551,
  0.918958134888791, 0.986386936267237, 0.362209822236419,
  0.000000000000000, 0.000000000000000, 0.000000000000000,
  0.000000000000000 ],
[ 0.763732576854455, 0.817282762358449, 0.801802919535959,
  0.900089095449775, 0.975704636491453, 0.707836537586060,
  0.755705808346586, 0.000000000000000, 0.000000000000000,
  0.000000000000000 ],
[ 0.904249454052971, 0.871097965261373, 0.982717262706270,
  0.239901207363622, 0.836519456769083, 0.896135326270534,
  0.930694340243023, 0.917708540815567, 0.000000000000000,
  0.000000000000000 ],
[ 0.944400908070716, 0.922589018494961, 0.984615718580670,
  0.514328661540623, 0.692362267147064, 0.931894098453677,
  0.956034127544344, 0.931221472309472, 0.540903688625053,
  0.000000000000000 ]]

en_distance_rescaled = np.transpose(np.array([
[ 0.443570948411811  ,    0.467602196999105    ,  0.893870160799932 ,
  0.864347190364447  ,    0.976608182392358    ,  0.187563183468210 ,
  0.426404699872689  ,    0.665107090128166    ,  0.885246991424583 ,
  0.924902909715270     ],
[ 0.899360150637444     , 0.860035135365386   ,   0.979659405613798 ,
  6.140678415933776E-002, 0.835118398056681   ,   0.884071658981068 ,
  0.923860000907362     , 0.905203414522289   ,   0.211286300932359 ,
  0.492104840907350 ]]))

# symmetrize it
for i in range(elec_num):
  for j in range(elec_num):
    ee_distance_rescaled[i][j] = ee_distance_rescaled[j][i]

type_nucl_num = 1
aord_num     = 5
bord_num     = 5
cord_num     = 5
dim_cord_vect= 23
type_nucl_vector = [ 1, 1]
aord_vector = [
[0.000000000000000E+000],
[0.000000000000000E+000],
[-0.380512000000000E+000],
[-0.157996000000000E+000],
[-3.155800000000000E-002],
[2.151200000000000E-002]]

bord_vector = [ 0.500000000000000E-000,  0.153660000000000E-000,  6.722620000000000E-002,
  2.157000000000000E-002,  7.309600000000000E-003,  2.866000000000000E-003]
cord_vector = [ 0.571702000000000E-000, -0.514253000000000E-000, -0.513043000000000E-000,
  9.486000000000000E-003, -4.205000000000000E-003,  0.426325800000000E-000,
  8.288150000000000E-002,  5.118600000000000E-003, -2.997800000000000E-003,
 -5.270400000000000E-003, -7.499999999999999E-005, -8.301649999999999E-002,
  1.454340000000000E-002,  5.143510000000000E-002,  9.250000000000000E-004,
 -4.099100000000000E-003,  4.327600000000000E-003, -1.654470000000000E-003,
  2.614000000000000E-003, -1.477000000000000E-003, -1.137000000000000E-003,
 -4.010475000000000E-002,  6.106710000000000E-003 ]
cord_vector_full = [
[ 0.571702000000000E-000, -0.514253000000000E-000, -0.513043000000000E-000,
  9.486000000000000E-003, -4.205000000000000E-003,  0.426325800000000E-000,
  8.288150000000000E-002,  5.118600000000000E-003, -2.997800000000000E-003,
 -5.270400000000000E-003, -7.499999999999999E-005, -8.301649999999999E-002,
  1.454340000000000E-002,  5.143510000000000E-002,  9.250000000000000E-004,
 -4.099100000000000E-003,  4.327600000000000E-003, -1.654470000000000E-003,
  2.614000000000000E-003, -1.477000000000000E-003, -1.137000000000000E-003,
 -4.010475000000000E-002,  6.106710000000000E-003 ],
[ 0.571702000000000E-000, -0.514253000000000E-000, -0.513043000000000E-000,
  9.486000000000000E-003, -4.205000000000000E-003,  0.426325800000000E-000,
  8.288150000000000E-002,  5.118600000000000E-003, -2.997800000000000E-003,
 -5.270400000000000E-003, -7.499999999999999E-005, -8.301649999999999E-002,
  1.454340000000000E-002,  5.143510000000000E-002,  9.250000000000000E-004,
 -4.099100000000000E-003,  4.327600000000000E-003, -1.654470000000000E-003,
  2.614000000000000E-003, -1.477000000000000E-003, -1.137000000000000E-003,
 -4.010475000000000E-002,  6.106710000000000E-003 ],
]
lkpm_combined_index = [[1 , 1 , 2 , 0],
          [0 , 0 , 2 , 1],
          [1 , 2 , 3 , 0],
          [2 , 1 , 3 , 0],
          [0 , 1 , 3 , 1],
          [1 , 0 , 3 , 1],
          [1 , 3 , 4 , 0],
          [2 , 2 , 4 , 0],
          [0 , 2 , 4 , 1],
          [3 , 1 , 4 , 0],
          [1 , 1 , 4 , 1],
          [2 , 0 , 4 , 1],
          [0 , 0 , 4 , 2],
          [1 , 4 , 5 , 0],
          [2 , 3 , 5 , 0],
          [0 , 3 , 5 , 1],
          [3 , 2 , 5 , 0],
          [1 , 2 , 5 , 1],
          [4 , 1 , 5 , 0],
          [2 , 1 , 5 , 1],
          [0 , 1 , 5 , 2],
          [3 , 0 , 5 , 1],
          [1 , 0 , 5 , 2]]

kappa     = 1.0
kappa_inv = 1.0/kappa
   #+END_SRC

