qmckl_jastrow.html

<div id="outline-container-orge187fdf" class="outline-2">
<h2 id="orge187fdf"><span class="section-number-2">2</span> Context</h2>
<div class="outline-text-2" id="text-2">
<p>
The following data stored in the context:
</p>

<table id="org1c584b2" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">In/Out</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>uninitialized</code></td>
<td class="org-left"><code>int32_t</code></td>
<td class="org-left">in</td>
<td class="org-left">Keeps bits set for uninitialized data</td>
</tr>

<tr>
<td class="org-left"><code>aord_num</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">in</td>
<td class="org-left">The number of a coeffecients</td>
</tr>

<tr>
<td class="org-left"><code>bord_num</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">in</td>
<td class="org-left">The number of b coeffecients</td>
</tr>

<tr>
<td class="org-left"><code>cord_num</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">in</td>
<td class="org-left">The number of c coeffecients</td>
</tr>

<tr>
<td class="org-left"><code>type_nucl_num</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">in</td>
<td class="org-left">Number of Nucleii types</td>
</tr>

<tr>
<td class="org-left"><code>type_nucl_vector</code></td>
<td class="org-left"><code>int64_t[nucl_num]</code></td>
<td class="org-left">in</td>
<td class="org-left">IDs of types of Nuclei</td>
</tr>

<tr>
<td class="org-left"><code>aord_vector</code></td>
<td class="org-left"><code>double[aord_num + 1][type_nucl_num]</code></td>
<td class="org-left">in</td>
<td class="org-left">Order of a polynomial coefficients</td>
</tr>

<tr>
<td class="org-left"><code>bord_vector</code></td>
<td class="org-left"><code>double[bord_num + 1]</code></td>
<td class="org-left">in</td>
<td class="org-left">Order of b polynomial coefficients</td>
</tr>

<tr>
<td class="org-left"><code>cord_vector</code></td>
<td class="org-left"><code>double[cord_num][type_nucl_num]</code></td>
<td class="org-left">in</td>
<td class="org-left">Order of c polynomial coefficients</td>
</tr>

<tr>
<td class="org-left"><code>factor_ee</code></td>
<td class="org-left"><code>double[walker.num]</code></td>
<td class="org-left">out</td>
<td class="org-left">Jastrow factor: electron-electron part</td>
</tr>

<tr>
<td class="org-left"><code>factor_ee_date</code></td>
<td class="org-left"><code>uint64_t</code></td>
<td class="org-left">out</td>
<td class="org-left">Jastrow factor: electron-electron part</td>
</tr>

<tr>
<td class="org-left"><code>factor_en</code></td>
<td class="org-left"><code>double[walker.num]</code></td>
<td class="org-left">out</td>
<td class="org-left">Jastrow factor: electron-nucleus  part</td>
</tr>

<tr>
<td class="org-left"><code>factor_en_date</code></td>
<td class="org-left"><code>uint64_t</code></td>
<td class="org-left">out</td>
<td class="org-left">Jastrow factor: electron-nucleus  part</td>
</tr>

<tr>
<td class="org-left"><code>factor_een</code></td>
<td class="org-left"><code>double[walker.num]</code></td>
<td class="org-left">out</td>
<td class="org-left">Jastrow factor: electron-electron-nucleus  part</td>
</tr>

<tr>
<td class="org-left"><code>factor_een_date</code></td>
<td class="org-left"><code>uint64_t</code></td>
<td class="org-left">out</td>
<td class="org-left">Jastrow factor: electron-electron-nucleus  part</td>
</tr>

<tr>
<td class="org-left"><code>factor_ee_deriv_e</code></td>
<td class="org-left"><code>double[4][nelec][walker.num]</code></td>
<td class="org-left">out</td>
<td class="org-left">Derivative of the Jastrow factor: electron-electron-nucleus  part</td>
</tr>

<tr>
<td class="org-left"><code>factor_ee_deriv_e_date</code></td>
<td class="org-left"><code>uint64_t</code></td>
<td class="org-left">out</td>
<td class="org-left">Keep track of the date for the derivative</td>
</tr>

<tr>
<td class="org-left"><code>factor_en_deriv_e</code></td>
<td class="org-left"><code>double[4][nelec][walker.num]</code></td>
<td class="org-left">out</td>
<td class="org-left">Derivative of the Jastrow factor: electron-electron-nucleus  part</td>
</tr>

<tr>
<td class="org-left"><code>factor_en_deriv_e_date</code></td>
<td class="org-left"><code>uint64_t</code></td>
<td class="org-left">out</td>
<td class="org-left">Keep track of the date for the en derivative</td>
</tr>

<tr>
<td class="org-left"><code>factor_een_deriv_e</code></td>
<td class="org-left"><code>double[4][nelec][walker.num]</code></td>
<td class="org-left">out</td>
<td class="org-left">Derivative of the Jastrow factor: electron-electron-nucleus  part</td>
</tr>

<tr>
<td class="org-left"><code>factor_een_deriv_e_date</code></td>
<td class="org-left"><code>uint64_t</code></td>
<td class="org-left">out</td>
<td class="org-left">Keep track of the date for the een derivative</td>
</tr>
</tbody>
</table>

<p>
computed data:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">In/Out</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>dim_cord_vect</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">Number of unique C coefficients</td>
</tr>

<tr>
<td class="org-left"><code>dim_cord_vect_date</code></td>
<td class="org-left"><code>uint64_t</code></td>
<td class="org-left">Number of unique C coefficients</td>
</tr>

<tr>
<td class="org-left"><code>asymp_jasb</code></td>
<td class="org-left"><code>double[2]</code></td>
<td class="org-left">Asymptotic component</td>
</tr>

<tr>
<td class="org-left"><code>asymp_jasb_date</code></td>
<td class="org-left"><code>uint64_t</code></td>
<td class="org-left">Asymptotic component</td>
</tr>

<tr>
<td class="org-left"><code>cord_vect_full</code></td>
<td class="org-left"><code>double[dim_cord_vect][nucl_num]</code></td>
<td class="org-left">vector of non-zero coefficients</td>
</tr>

<tr>
<td class="org-left"><code>cord_vect_full_date</code></td>
<td class="org-left"><code>uint64_t</code></td>
<td class="org-left">Keep track of changes here</td>
</tr>

<tr>
<td class="org-left"><code>lkpm_combined_index</code></td>
<td class="org-left"><code>int64_t[4][dim_cord_vect]</code></td>
<td class="org-left">Transform l,k,p, and m into consecutive indices</td>
</tr>

<tr>
<td class="org-left"><code>lkpm_combined_index_date</code></td>
<td class="org-left"><code>uint64_t</code></td>
<td class="org-left">Transform l,k,p, and m into consecutive indices</td>
</tr>

<tr>
<td class="org-left"><code>tmp_c</code></td>
<td class="org-left"><code>double[walker.num][cord_num][cord_num+1][nucl_num][elec_num]</code></td>
<td class="org-left">vector of non-zero coefficients</td>
</tr>

<tr>
<td class="org-left"><code>dtmp_c</code></td>
<td class="org-left"><code>double[walker.num][elec_num][4][nucl_num][cord_num+1][cord_num]</code></td>
<td class="org-left">vector of non-zero coefficients</td>
</tr>

<tr>
<td class="org-left"><code>een_rescaled_n</code></td>
<td class="org-left"><code>double[walker.num][cord_num+1][nucl_num][elec_num]</code></td>
<td class="org-left">The electron-electron rescaled distances raised to the powers defined by cord</td>
</tr>

<tr>
<td class="org-left"><code>een_rescaled_n_date</code></td>
<td class="org-left"><code>uint64_t</code></td>
<td class="org-left">Keep track of the date of creation</td>
</tr>

<tr>
<td class="org-left"><code>een_rescaled_e_deriv_e</code></td>
<td class="org-left"><code>double[walker.num][cord_num+1][elec_num][4][elec_num]</code></td>
<td class="org-left">The electron-electron rescaled distances raised to the powers defined by cord derivatives wrt electrons</td>
</tr>

<tr>
<td class="org-left"><code>een_rescaled_e_deriv_e_date</code></td>
<td class="org-left"><code>uint64_t</code></td>
<td class="org-left">Keep track of the date of creation</td>
</tr>

<tr>
<td class="org-left"><code>een_rescaled_n_deriv_e</code></td>
<td class="org-left"><code>double[walker.num][cord_num+1][nucl_num][4][elec_num]</code></td>
<td class="org-left">The electron-electron rescaled distances raised to the powers defined by cord derivatives wrt electrons</td>
</tr>

<tr>
<td class="org-left"><code>een_rescaled_n_deriv_e_date</code></td>
<td class="org-left"><code>uint64_t</code></td>
<td class="org-left">Keep track of the date of creation</td>
</tr>
</tbody>
</table>
</div>
