qmckl_jastrow.html

<div id="outline-container-orgf2e88b2" class="outline-3">
<h3 id="orgf2e88b2"><span class="section-number-3">2.1</span> Data structure</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">qmckl_jastrow_struct</span>{
  <span style="color: #228b22;">int32_t</span>  <span style="color: #a0522d;">uninitialized</span>;
  <span style="color: #228b22;">int64_t</span>  <span style="color: #a0522d;">aord_num</span>;
  <span style="color: #228b22;">int64_t</span>  <span style="color: #a0522d;">bord_num</span>;
  <span style="color: #228b22;">int64_t</span>  <span style="color: #a0522d;">cord_num</span>;
  <span style="color: #228b22;">int64_t</span>  <span style="color: #a0522d;">type_nucl_num</span>;
  <span style="color: #228b22;">uint64_t</span>  <span style="color: #a0522d;">asymp_jasb_date</span>;
  <span style="color: #228b22;">uint64_t</span>  <span style="color: #a0522d;">tmp_c_date</span>;
  <span style="color: #228b22;">uint64_t</span>  <span style="color: #a0522d;">dtmp_c_date</span>;
  <span style="color: #228b22;">uint64_t</span>  <span style="color: #a0522d;">factor_ee_date</span>;
  <span style="color: #228b22;">uint64_t</span>  <span style="color: #a0522d;">factor_en_date</span>;
  <span style="color: #228b22;">uint64_t</span>  <span style="color: #a0522d;">factor_een_date</span>;
  <span style="color: #228b22;">uint64_t</span>  <span style="color: #a0522d;">factor_ee_deriv_e_date</span>;
  <span style="color: #228b22;">uint64_t</span>  <span style="color: #a0522d;">factor_en_deriv_e_date</span>;
  <span style="color: #228b22;">uint64_t</span>  <span style="color: #a0522d;">factor_een_deriv_e_date</span>;
  <span style="color: #228b22;">int64_t</span>* <span style="color: #a0522d;">type_nucl_vector</span>;
  <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">aord_vector</span>;
  <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">bord_vector</span>;
  <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">cord_vector</span>;
  <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">asymp_jasb</span>;
  <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">factor_ee</span>;
  <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">factor_en</span>;
  <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">factor_een</span>;
  <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">factor_ee_deriv_e</span>;
  <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">factor_en_deriv_e</span>;
  <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">factor_een_deriv_e</span>;
  <span style="color: #228b22;">int64_t</span>  <span style="color: #a0522d;">dim_cord_vect</span>;
  <span style="color: #228b22;">uint64_t</span>  <span style="color: #a0522d;">dim_cord_vect_date</span>;
  <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">cord_vect_full</span>;
  <span style="color: #228b22;">uint64_t</span>  <span style="color: #a0522d;">cord_vect_full_date</span>;
  <span style="color: #228b22;">int64_t</span>* <span style="color: #a0522d;">lkpm_combined_index</span>;
  <span style="color: #228b22;">uint64_t</span>  <span style="color: #a0522d;">lkpm_combined_index_date</span>;
  <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">tmp_c</span>;
  <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">dtmp_c</span>;
  <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">een_rescaled_e</span>;
  <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">een_rescaled_n</span>;
  <span style="color: #228b22;">uint64_t</span>  <span style="color: #a0522d;">een_rescaled_e_date</span>;
  <span style="color: #228b22;">uint64_t</span>  <span style="color: #a0522d;">een_rescaled_n_date</span>;
  <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">een_rescaled_e_deriv_e</span>;
  <span style="color: #228b22;">double</span> * <span style="color: #a0522d;">een_rescaled_n_deriv_e</span>;
  <span style="color: #228b22;">uint64_t</span>  <span style="color: #a0522d;">een_rescaled_e_deriv_e_date</span>;
  <span style="color: #228b22;">uint64_t</span>  <span style="color: #a0522d;">een_rescaled_n_deriv_e_date</span>;
  <span style="color: #228b22;">bool</span>     <span style="color: #a0522d;">provided</span>;
  <span style="color: #228b22;">char</span> *   <span style="color: #a0522d;">type</span>;

<span style="color: #483d8b;">  #ifdef</span> HAVE_HPC
  <span style="color: #228b22;">bool</span>     <span style="color: #a0522d;">gpu_offload</span>;
<span style="color: #483d8b;">  #endif</span>
} <span style="color: #228b22;">qmckl_jastrow_struct</span>;
</pre>
</div>


<p>
The <code>uninitialized</code> integer contains one bit set to one for each
initialization function which has not been called. It becomes equal
to zero after all initialization functions have been called. The
struct is then initialized and <code>provided == true</code>.
Some values are initialized by default, and are not concerned by
this mechanism.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_init_jastrow</span>(<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_init_jastrow</span>(<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>) {

  <span style="color: #a020f0;">if</span> (qmckl_context_check(context) == QMCKL_NULL_CONTEXT) {
    <span style="color: #a020f0;">return</span> <span style="color: #008b8b;">false</span>;
  }

  <span style="color: #228b22;">qmckl_context_struct</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">ctx</span> = (<span style="color: #228b22;">qmckl_context_struct</span>*) context;
  assert (ctx != <span style="color: #008b8b;">NULL</span>);

  ctx-&gt;jastrow.uninitialized = (1 &lt;&lt; 6) - 1;

  /* <span style="color: #b22222;">Default values </span>*/

  <span style="color: #a020f0;">return</span> QMCKL_SUCCESS;
}
</pre>
</div>
</div>
</div>
