qmckl_jastrow.html

<div id="outline-container-org4421665" class="outline-3">
<h3 id="org4421665"><span class="section-number-3">2.2</span> Access functions</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Along with these core functions, calculation of the jastrow factor
requires the following additional information to be set:
</p>


<p>
When all the data for the AOs have been provided, the following
function returns <code>true</code>.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">bool</span>      <span style="color: #0000ff;">qmckl_jastrow_provided</span>           (<span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>);
</pre>
</div>
</div>
</div>
