qmckl_jastrow.html

<div id="outline-container-org2ed9630" class="outline-3">
<h3 id="org2ed9630"><span class="section-number-3">2.4</span> Test</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-c">/* <span style="color: #b22222;">Reference input data </span>*/
<span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">walk_num</span>      = n2_walk_num;
<span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">elec_num</span>      = n2_elec_num;
<span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">elec_up_num</span>   = n2_elec_up_num;
<span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">elec_dn_num</span>   = n2_elec_dn_num;
<span style="color: #228b22;">double</span>  <span style="color: #a0522d;">rescale_factor_kappa_ee</span>   = 1.0;
<span style="color: #228b22;">double</span>  <span style="color: #a0522d;">rescale_factor_kappa_en</span>   = 1.0;
<span style="color: #228b22;">double</span>  <span style="color: #a0522d;">nucl_rescale_factor_kappa</span> = 1.0;
<span style="color: #228b22;">double</span>* <span style="color: #a0522d;">elec_coord</span>    = &amp;(n2_elec_coord[0][0][0]);

<span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>*   <span style="color: #a0522d;">nucl_charge</span>   = n2_charge;
<span style="color: #228b22;">int64_t</span>  <span style="color: #a0522d;">nucl_num</span>      = n2_nucl_num;
<span style="color: #228b22;">double</span>*  <span style="color: #a0522d;">nucl_coord</span>    = &amp;(n2_nucl_coord[0][0]);
<span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size_max</span>;

/* <span style="color: #b22222;">Provide Electron data </span>*/

<span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #a0522d;">rc</span>;

assert(!qmckl_electron_provided(context));

rc = qmckl_set_electron_num (context, elec_up_num, elec_dn_num);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);

<span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">qmckl_electron_provided</span>(<span style="color: #a0522d;">context</span>));

<span style="color: #228b22;">double</span> <span style="color: #a0522d;">k_ee</span> = 0.;
<span style="color: #228b22;">double</span> <span style="color: #a0522d;">k_en</span> = 0.;
rc = qmckl_get_electron_rescale_factor_ee (context, &amp;k_ee);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
<span style="color: #0000ff;">assert</span>(k_ee == 1.0);

rc = qmckl_get_electron_rescale_factor_en (context, &amp;k_en);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
<span style="color: #0000ff;">assert</span>(k_en == 1.0);

rc = qmckl_set_electron_rescale_factor_en(context, rescale_factor_kappa_en);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);

rc = qmckl_set_electron_rescale_factor_ee(context, rescale_factor_kappa_ee);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);

rc = qmckl_get_electron_rescale_factor_ee (context, &amp;k_ee);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
<span style="color: #0000ff;">assert</span>(k_ee == rescale_factor_kappa_ee);

rc = qmckl_get_electron_rescale_factor_en (context, &amp;k_en);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
<span style="color: #0000ff;">assert</span>(k_en == rescale_factor_kappa_en);


rc = qmckl_set_electron_coord (context, <span style="color: #8b2252;">'N'</span>, walk_num, elec_coord, walk_num*3*elec_num);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);

<span style="color: #228b22;">double</span> <span style="color: #a0522d;">elec_coord2</span>[walk_num*3*elec_num];

rc = qmckl_get_electron_coord (context, <span style="color: #8b2252;">'N'</span>, elec_coord2, walk_num*3*elec_num);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
<span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">i</span>=0 ; i&lt;3*elec_num ; ++i) {
  assert( elec_coord[i] == elec_coord2[i] );
 }


/* <span style="color: #b22222;">Provide Nucleus data </span>*/

assert(!qmckl_nucleus_provided(context));

rc = qmckl_set_nucleus_num (context, nucl_num);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
assert(!qmckl_nucleus_provided(context));

<span style="color: #228b22;">double</span> <span style="color: #a0522d;">k</span>;
rc = qmckl_get_nucleus_rescale_factor (context, &amp;k);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
<span style="color: #0000ff;">assert</span>(k == 1.0);


rc = qmckl_set_nucleus_rescale_factor (context, nucl_rescale_factor_kappa);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);

rc = qmckl_get_nucleus_rescale_factor (context, &amp;k);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
<span style="color: #0000ff;">assert</span>(k == nucl_rescale_factor_kappa);

<span style="color: #228b22;">double</span> <span style="color: #a0522d;">nucl_coord2</span>[3*nucl_num];

rc = qmckl_get_nucleus_coord (context, <span style="color: #8b2252;">'T'</span>, nucl_coord2, 3*nucl_num);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_NOT_PROVIDED);

rc = qmckl_set_nucleus_coord (context, <span style="color: #8b2252;">'T'</span>, &amp;(nucl_coord[0]), 3*nucl_num);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);

assert(!qmckl_nucleus_provided(context));

rc = qmckl_get_nucleus_coord (context, <span style="color: #8b2252;">'N'</span>, nucl_coord2, nucl_num*3);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
<span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">k</span>=0 ; k&lt;3 ; ++k) {
  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">i</span>=0 ; i&lt;nucl_num ; ++i) {
    assert( nucl_coord[nucl_num*k+i] == nucl_coord2[3*i+k] );
  }
}

rc = qmckl_get_nucleus_coord (context, <span style="color: #8b2252;">'T'</span>, nucl_coord2, nucl_num*3);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
<span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">i</span>=0 ; i&lt;3*nucl_num ; ++i) {
  assert( nucl_coord[i] == nucl_coord2[i] );
}

<span style="color: #228b22;">double</span> <span style="color: #a0522d;">nucl_charge2</span>[nucl_num];

rc = qmckl_get_nucleus_charge(context, nucl_charge2, nucl_num);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_NOT_PROVIDED);

rc = qmckl_set_nucleus_charge(context, nucl_charge, nucl_num);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);

rc = qmckl_get_nucleus_charge(context, nucl_charge2, nucl_num);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
<span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">i</span>=0 ; i&lt;nucl_num ; ++i) {
  assert( nucl_charge[i] == nucl_charge2[i] );
 }
<span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">qmckl_nucleus_provided</span>(<span style="color: #a0522d;">context</span>));

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7736ec5" class="outline-2">
<h2 id="org7736ec5"><span class="section-number-2">3</span> Computation</h2>
<div class="outline-text-2" id="text-3">
<p>
The computed data is stored in the context so that it can be reused
by different kernels. To ensure that the data is valid, for each
computed data the date of the context is stored when it is computed.
To know if some data needs to be recomputed, we check if the date of
the dependencies are more recent than the date of the data to
compute. If it is the case, then the data is recomputed and the
current date is stored.
</p>
</div>

<div id="outline-container-orgfd671d4" class="outline-3">
<h3 id="orgfd671d4"><span class="section-number-3">3.1</span> Asymptotic component for \(J_{ee}\)</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Calculate the asymptotic component <code>asymp_jasb</code> to be substracted from the final
electron-electron jastrow factor \(J_{\text{ee}}\). The asymptotic component is calculated
via the <code>bord_vector</code> and the electron-electron rescale factor <code>rescale_factor_kappa</code>.
</p>

<p>
\[
  J_{\text{ee}}^{\infty} = \frac{b_1 \kappa^{-1}}{1 + b_2  \kappa^{-1}}
  \]
</p>
</div>
