qmckl_jastrow.html

<div id="outline-container-org3edfe94" class="outline-4">
<h4 id="org3edfe94"><span class="section-number-4">3.1.1</span> Get</h4>
<div class="outline-text-4" id="text-3-1-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span>
<span style="color: #0000ff;">qmckl_get_jastrow_asymp_jasb</span>(<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>,
                             <span style="color: #228b22;">double</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">asymp_jasb</span>,
                             <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size_max</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-org37a9168" class="outline-4">
<h4 id="org37a9168"><span class="section-number-4">3.1.2</span> Compute</h4>
<div class="outline-text-4" id="text-3-1-2">
<table id="org7f332a4" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">In/Out</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>context</code></td>
<td class="org-left"><code>qmckl_context</code></td>
<td class="org-left">in</td>
<td class="org-left">Global state</td>
</tr>

<tr>
<td class="org-left"><code>bord_num</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">in</td>
<td class="org-left">Order of the polynomial</td>
</tr>

<tr>
<td class="org-left"><code>bord_vector</code></td>
<td class="org-left"><code>double[bord_num+1]</code></td>
<td class="org-left">in</td>
<td class="org-left">Values of b</td>
</tr>

<tr>
<td class="org-left"><code>rescale_factor_kappa_ee</code></td>
<td class="org-left"><code>double</code></td>
<td class="org-left">in</td>
<td class="org-left">Electron coordinates</td>
</tr>

<tr>
<td class="org-left"><code>asymp_jasb</code></td>
<td class="org-left"><code>double[2]</code></td>
<td class="org-left">out</td>
<td class="org-left">Asymptotic value</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-f90"><span style="color: #228b22;">integer </span><span style="color: #a020f0;">function</span><span style="color: #a0522d;"> </span><span style="color: #0000ff;">qmckl_compute_asymp_jasb_f</span><span style="color: #000000; background-color: #ffffff;">(context, bord_num, bord_vector, rescale_factor_kappa_ee, asymp_jasb)</span><span style="color: #a0522d;"> </span><span style="color: #a020f0;">&amp;</span>
     <span style="color: #a020f0;">result</span>(info)
  <span style="color: #a020f0;">use</span> <span style="color: #0000ff;">qmckl</span>
  <span style="color: #a020f0;">implicit</span> <span style="color: #228b22;">none</span>
  <span style="color: #228b22;">integer</span>(qmckl_context), <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> context</span>
  <span style="color: #228b22;">integer</span>*8             , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> bord_num</span>
  <span style="color: #228b22;">double precision</span>      , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> bord_vector(bord_num + 1)</span>
  <span style="color: #228b22;">double precision</span>      , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> rescale_factor_kappa_ee</span>
  <span style="color: #228b22;">double precision</span>      , <span style="color: #a020f0;">intent</span>(out) ::<span style="color: #a0522d;"> asymp_jasb(2)</span>

  <span style="color: #228b22;">integer</span>*8 ::<span style="color: #a0522d;"> i, p</span>
  <span style="color: #228b22;">double precision</span>   ::<span style="color: #a0522d;"> kappa_inv, x, asym_one</span>
  kappa_inv = 1.0d0 / rescale_factor_kappa_ee

  info = QMCKL_SUCCESS

  <span style="color: #a020f0;">if</span> (context == QMCKL_NULL_CONTEXT) <span style="color: #a020f0;">then</span>
     info = QMCKL_INVALID_CONTEXT
     <span style="color: #a020f0;">return</span>
  <span style="color: #a020f0;">endif</span>

  <span style="color: #a020f0;">if</span> (bord_num &lt;= 0) <span style="color: #a020f0;">then</span>
     info = QMCKL_INVALID_ARG_2
     <span style="color: #a020f0;">return</span>
  <span style="color: #a020f0;">endif</span>

  asym_one = bord_vector(1) * kappa_inv / (1.0d0 + bord_vector(2) * kappa_inv)
  asymp_jasb(:) = (/asym_one, 0.5d0 * asym_one/)

  <span style="color: #a020f0;">do</span> i = 1, 2
     x = kappa_inv
     <span style="color: #a020f0;">do</span> p = 2, bord_num
        x = x * kappa_inv
        asymp_jasb(i) = asymp_jasb(i) + bord_vector(p + 1) * x
     <span style="color: #a020f0;">end do</span>
  <span style="color: #a020f0;">end do</span>

<span style="color: #a020f0;">end function</span> <span style="color: #0000ff;">qmckl_compute_asymp_jasb_f</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_compute_asymp_jasb</span> (
          <span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>,
          <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">bord_num</span>,
          <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">bord_vector</span>,
          <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span> <span style="color: #a0522d;">rescale_factor_kappa_ee</span>,
          <span style="color: #228b22;">double</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">asymp_jasb</span> ) {

    <span style="color: #a020f0;">if</span> (context == QMCKL_NULL_CONTEXT){
      <span style="color: #a020f0;">return</span> QMCKL_INVALID_CONTEXT;
    }

    <span style="color: #a020f0;">if</span> (bord_num &lt;= 0) {
      <span style="color: #a020f0;">return</span> QMCKL_INVALID_ARG_2;
    }

    <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span> <span style="color: #a0522d;">kappa_inv</span> = 1.0 / rescale_factor_kappa_ee;
    <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span> <span style="color: #a0522d;">asym_one</span> = bord_vector[0] * kappa_inv / (1.0 + bord_vector[1] * kappa_inv);
    asymp_jasb[0] = asym_one;
    asymp_jasb[1] = 0.5 * asym_one;

    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span> = 0 ; i &lt;= 1; ++i) {
      <span style="color: #228b22;">double</span> <span style="color: #a0522d;">x</span> = kappa_inv;
      <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">p</span> = 1; p &lt; bord_num; ++p){
        x *= kappa_inv;
        asymp_jasb[i] = asymp_jasb[i] + bord_vector[p + 1] * x;
      }
    }

  <span style="color: #a020f0;">return</span> QMCKL_SUCCESS;
}
</pre>
</div>
</div>
</div>
