qmckl_jastrow.html

<div id="outline-container-org2c4b87c" class="outline-4">
<h4 id="org2c4b87c"><span class="section-number-4">3.1.3</span> Test</h4>
<div class="outline-text-4" id="text-3-1-3">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">qmckl_electron_provided</span>(<span style="color: #a0522d;">context</span>));

<span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">type_nucl_num</span> = n2_type_nucl_num;
<span style="color: #228b22;">int64_t</span>* <span style="color: #a0522d;">type_nucl_vector</span> = &amp;(n2_type_nucl_vector[0]);
<span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">aord_num</span> = n2_aord_num;
<span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">bord_num</span> = n2_bord_num;
<span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">cord_num</span> = n2_cord_num;
<span style="color: #228b22;">double</span>* <span style="color: #a0522d;">aord_vector</span> = &amp;(n2_aord_vector[0][0]);
<span style="color: #228b22;">double</span>* <span style="color: #a0522d;">bord_vector</span> = &amp;(n2_bord_vector[0]);
<span style="color: #228b22;">double</span>* <span style="color: #a0522d;">cord_vector</span> = &amp;(n2_cord_vector[0][0]);
<span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">dim_cord_vect</span>=0;

/* <span style="color: #b22222;">Initialize the Jastrow data </span>*/
rc = qmckl_init_jastrow(context);
assert(!qmckl_jastrow_provided(context));

/* <span style="color: #b22222;">Set the data </span>*/
rc = qmckl_set_jastrow_ord_num(context, aord_num, bord_num, cord_num);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
rc = qmckl_set_jastrow_type_nucl_num(context, type_nucl_num);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
rc = qmckl_set_jastrow_type_nucl_vector(context, type_nucl_vector, nucl_num);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
rc = qmckl_set_jastrow_aord_vector(context, aord_vector,(aord_num+1)*type_nucl_num);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
rc = qmckl_set_jastrow_bord_vector(context, bord_vector,(bord_num+1));
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
rc = qmckl_get_jastrow_dim_cord_vect(context, &amp;dim_cord_vect);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);
rc = qmckl_set_jastrow_cord_vector(context, cord_vector,dim_cord_vect*type_nucl_num);
<span style="color: #0000ff;">assert</span>(rc == QMCKL_SUCCESS);

/* <span style="color: #b22222;">Check if Jastrow is properly initialized </span>*/
<span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">qmckl_jastrow_provided</span>(<span style="color: #a0522d;">context</span>));

<span style="color: #228b22;">double</span> <span style="color: #a0522d;">asymp_jasb</span>[2];
rc = qmckl_get_jastrow_asymp_jasb(context, asymp_jasb,2);

// <span style="color: #b22222;">calculate asymp_jasb</span>
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">asymp_jasb</span>[0]-0.5323750557252571) &lt; 1.e-12);
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">asymp_jasb</span>[1]-0.31567342786262853) &lt; 1.e-12);

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3abd10e" class="outline-3">
<h3 id="org3abd10e"><span class="section-number-3">3.2</span> Electron-electron component \(f_{ee}\)</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Calculate the electron-electron jastrow component <code>factor_ee</code> using the <code>asymp_jasb</code>
componenet and the electron-electron rescaled distances <code>ee_distance_rescaled</code>.
</p>

<p>
\[
f_{ee} = \sum_{i,j<i} \left\{ \frac{ \eta B_0 C_{ij}}{1 - B_1 C_{ij}}  - J_{asymp} + \sum^{nord}_{k}B_k C_{ij}^k \right\}
  \]
</p>
</div>
