qmckl_jastrow.html

<div id="outline-container-orgbebc7c5" class="outline-4">
<h4 id="orgbebc7c5"><span class="section-number-4">3.2.3</span> Test</h4>
<div class="outline-text-4" id="text-3-2-3">
<div class="org-src-container">
<pre class="src src-c">/* <span style="color: #b22222;">Check if Jastrow is properly initialized </span>*/
<span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">qmckl_jastrow_provided</span>(<span style="color: #a0522d;">context</span>));

<span style="color: #228b22;">double</span> <span style="color: #a0522d;">factor_ee</span>[walk_num];
rc = qmckl_get_jastrow_factor_ee(context, factor_ee, walk_num);

// <span style="color: #b22222;">calculate factor_ee</span>
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">factor_ee</span>[0]+4.282760865958113) &lt; 1.e-12);

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org513c2f9" class="outline-3">
<h3 id="org513c2f9"><span class="section-number-3">3.3</span> Electron-electron component derivative \(f'_{ee}\)</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Calculate the derivative of the <code>factor_ee</code> using the <code>ee_distance_rescaled</code> and
the electron-electron rescaled distances derivatives <code>ee_distance_rescaled_deriv_e</code>.
There are four components, the gradient which has 3 components in the \(x, y, z\)
directions and the laplacian as the last component.
</p>

<p>
TODO: Add equation
</p>
</div>
