qmckl_jastrow.html


<div id="outline-container-orgd83e65b" class="outline-4">
<h4 id="orgd83e65b"><span class="section-number-4">3.3.1</span> Get</h4>
<div class="outline-text-4" id="text-3-3-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span>
<span style="color: #0000ff;">qmckl_get_jastrow_factor_ee_deriv_e</span>(<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>,
                                    <span style="color: #228b22;">double</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">factor_ee_deriv_e</span>,
                                    <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size_max</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-org5379d75" class="outline-4">
<h4 id="org5379d75"><span class="section-number-4">3.3.2</span> Compute</h4>
<div class="outline-text-4" id="text-3-3-2">
<table id="orgaf5f34f" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">In/Out</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>context</code></td>
<td class="org-left"><code>qmckl_context</code></td>
<td class="org-left">in</td>
<td class="org-left">Global state</td>
</tr>

<tr>
<td class="org-left"><code>walk_num</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">in</td>
<td class="org-left">Number of walkers</td>
</tr>

<tr>
<td class="org-left"><code>elec_num</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">in</td>
<td class="org-left">Number of electrons</td>
</tr>

<tr>
<td class="org-left"><code>up_num</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">in</td>
<td class="org-left">Number of alpha electrons</td>
</tr>

<tr>
<td class="org-left"><code>bord_num</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">in</td>
<td class="org-left">Number of coefficients</td>
</tr>

<tr>
<td class="org-left"><code>bord_vector</code></td>
<td class="org-left"><code>double[bord_num+1]</code></td>
<td class="org-left">in</td>
<td class="org-left">List of coefficients</td>
</tr>

<tr>
<td class="org-left"><code>ee_distance_rescaled</code></td>
<td class="org-left"><code>double[walk_num][elec_num][elec_num]</code></td>
<td class="org-left">in</td>
<td class="org-left">Electron-electron distances</td>
</tr>

<tr>
<td class="org-left"><code>ee_distance_rescaled_deriv_e</code></td>
<td class="org-left"><code>double[walk_num][4][elec_num][elec_num]</code></td>
<td class="org-left">in</td>
<td class="org-left">Electron-electron distances</td>
</tr>

<tr>
<td class="org-left"><code>factor_ee_deriv_e</code></td>
<td class="org-left"><code>double[walk_num][4][elec_num]</code></td>
<td class="org-left">out</td>
<td class="org-left">Electron-electron distances</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-f90"><span style="color: #228b22;">integer</span><span style="color: #a0522d;"> function qmckl_compute_factor_ee_deriv_e_doc_f( </span><span style="color: #a020f0;">&amp;</span>
     context, walk_num, elec_num, up_num, bord_num, <span style="color: #a020f0;">&amp;</span>
     bord_vector, ee_distance_rescaled, ee_distance_rescaled_deriv_e,  <span style="color: #a020f0;">&amp;</span>
     factor_ee_deriv_e) <span style="color: #a020f0;">&amp;</span>
     <span style="color: #a020f0;">result</span>(info)
  <span style="color: #a020f0;">use</span> <span style="color: #0000ff;">qmckl</span>
  <span style="color: #a020f0;">implicit</span> <span style="color: #228b22;">none</span>
  <span style="color: #228b22;">integer</span>(qmckl_context), <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> context</span>
  <span style="color: #228b22;">integer</span>*8             , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> walk_num, elec_num, bord_num, up_num</span>
  <span style="color: #228b22;">double precision</span>      , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> bord_vector(bord_num + 1)</span>
  <span style="color: #228b22;">double precision</span>      , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> ee_distance_rescaled(elec_num, elec_num,walk_num)</span>
  <span style="color: #228b22;">double precision</span>      , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> ee_distance_rescaled_deriv_e(4,elec_num, elec_num,walk_num)   </span>!<span style="color: #b22222;">TODO</span>
  <span style="color: #228b22;">double precision</span>      , <span style="color: #a020f0;">intent</span>(out) ::<span style="color: #a0522d;"> factor_ee_deriv_e(elec_num,4,walk_num)</span>

  <span style="color: #228b22;">integer</span>*8 ::<span style="color: #a0522d;"> i, j, p, nw, ii</span>
  <span style="color: #228b22;">double precision</span>   ::<span style="color: #a0522d;"> x, spin_fact, y</span>
  <span style="color: #228b22;">double precision</span>   ::<span style="color: #a0522d;"> den, invden, invden2, invden3, xinv</span>
  <span style="color: #228b22;">double precision</span>   ::<span style="color: #a0522d;"> lap1, lap2, lap3, third</span>
  <span style="color: #228b22;">double precision</span>, <span style="color: #a020f0;">dimension</span>(3) ::<span style="color: #a0522d;"> pow_ser_g</span>
  <span style="color: #228b22;">double precision</span>, <span style="color: #a020f0;">dimension</span>(4) ::<span style="color: #a0522d;"> dx</span>

  info = QMCKL_SUCCESS

  <span style="color: #a020f0;">if</span> (context == QMCKL_NULL_CONTEXT) <span style="color: #a020f0;">then</span>
     info = QMCKL_INVALID_CONTEXT
     <span style="color: #a020f0;">return</span>
  <span style="color: #a020f0;">endif</span>

  <span style="color: #a020f0;">if</span> (walk_num &lt;= 0) <span style="color: #a020f0;">then</span>
     info = QMCKL_INVALID_ARG_2
     <span style="color: #a020f0;">return</span>
  <span style="color: #a020f0;">endif</span>

  <span style="color: #a020f0;">if</span> (elec_num &lt;= 0) <span style="color: #a020f0;">then</span>
     info = QMCKL_INVALID_ARG_3
     <span style="color: #a020f0;">return</span>
  <span style="color: #a020f0;">endif</span>

  <span style="color: #a020f0;">if</span> (bord_num &lt;= 0) <span style="color: #a020f0;">then</span>
     info = QMCKL_INVALID_ARG_4
     <span style="color: #a020f0;">return</span>
  <span style="color: #a020f0;">endif</span>

  factor_ee_deriv_e = 0.0d0
  third = 1.0d0 / 3.0d0

  <span style="color: #a020f0;">do</span> nw =1, walk_num
  <span style="color: #a020f0;">do</span> j = 1, elec_num
     <span style="color: #a020f0;">do</span> i = 1, elec_num
        x = ee_distance_rescaled(i,j,nw)
        <span style="color: #a020f0;">if</span>(<span style="color: #a020f0;">abs</span>(x) &lt; 1.0d-18) <span style="color: #a020f0;">cycle</span>
        pow_ser_g   = 0.0d0
        spin_fact   = 1.0d0
        den         = 1.0d0 + bord_vector(2) * x
        invden      = 1.0d0 / den
        invden2     = invden * invden
        invden3     = invden2 * invden
        xinv        = 1.0d0 / (x + 1.0d-18)

        dx(1) = ee_distance_rescaled_deriv_e(1, i, j, nw)
        dx(2) = ee_distance_rescaled_deriv_e(2, i, j, nw)
        dx(3) = ee_distance_rescaled_deriv_e(3, i, j, nw)
        dx(4) = ee_distance_rescaled_deriv_e(4, i, j, nw)

        <span style="color: #a020f0;">if</span>((i <span style="color: #a020f0;">.LE.</span> up_num <span style="color: #a020f0;">.AND.</span> j <span style="color: #a020f0;">.LE.</span> up_num ) <span style="color: #a020f0;">.OR.</span>  <span style="color: #a020f0;">&amp;</span>
           (i <span style="color: #a020f0;">.GT.</span> up_num <span style="color: #a020f0;">.AND.</span> j <span style="color: #a020f0;">.GT.</span> up_num)) <span style="color: #a020f0;">then</span>
          spin_fact = 0.5d0
        <span style="color: #a020f0;">endif</span>

        lap1 = 0.0d0
        lap2 = 0.0d0
        lap3 = 0.0d0
        <span style="color: #a020f0;">do</span> ii = 1, 3
          x = ee_distance_rescaled(i, j, nw)
          <span style="color: #a020f0;">if</span>(<span style="color: #a020f0;">abs</span>(x) &lt; 1.0d-18) <span style="color: #a020f0;">cycle</span>
          <span style="color: #a020f0;">do</span> p = 2, bord_num
            y = p * bord_vector(p + 1) * x
            pow_ser_g(ii) = pow_ser_g(ii) + y * dx(ii)
            lap1 = lap1 + (p - 1) * y * xinv * dx(ii) * dx(ii)
            lap2 = lap2 + y
            x = x * ee_distance_rescaled(i, j, nw)
          <span style="color: #a020f0;">end do</span>

          lap3 = lap3 - 2.0d0 * bord_vector(2) * dx(ii) * dx(ii)

          factor_ee_deriv_e( j, ii, nw) = factor_ee_deriv_e( j, ii, nw) + spin_fact * bord_vector(1)  * <span style="color: #a020f0;">&amp;</span>
                                dx(ii) * invden2 + pow_ser_g(ii)
        <span style="color: #a020f0;">end do</span>

        ii = 4
        lap2 = lap2 * dx(ii) * third
        lap3 = lap3 + den * dx(ii)
        lap3 = lap3 * (spin_fact * bord_vector(1) * invden3)
        factor_ee_deriv_e( j, ii, nw) = factor_ee_deriv_e( j, ii, nw) + lap1 + lap2 + lap3

     <span style="color: #a020f0;">end do</span>
  <span style="color: #a020f0;">end do</span>
  <span style="color: #a020f0;">end do</span>

<span style="color: #a020f0;">end function</span> <span style="color: #0000ff;">qmckl_compute_factor_ee_deriv_e_doc_f</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_compute_factor_ee_deriv_e_hpc</span>(
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">walk_num</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">elec_num</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">up_num</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">bord_num</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">bord_vector</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">ee_distance_rescaled</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">ee_distance_rescaled_deriv_e</span>,
      <span style="color: #228b22;">double</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">factor_ee_deriv_e</span> ) {

  <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">ii</span>;
  <span style="color: #228b22;">double</span>  <span style="color: #a0522d;">pow_ser_g</span>[3];
  <span style="color: #228b22;">double</span>  <span style="color: #a0522d;">dx</span>[4];
  <span style="color: #228b22;">double</span>  <span style="color: #a0522d;">x</span>, <span style="color: #a0522d;">spin_fact</span>, <span style="color: #a0522d;">y</span>;
  <span style="color: #228b22;">double</span>  <span style="color: #a0522d;">den</span>, <span style="color: #a0522d;">invden</span>, <span style="color: #a0522d;">invden2</span>, <span style="color: #a0522d;">invden3</span>, <span style="color: #a0522d;">xinv</span>;
  <span style="color: #228b22;">double</span>  <span style="color: #a0522d;">lap1</span>, <span style="color: #a0522d;">lap2</span>, <span style="color: #a0522d;">lap3</span>, <span style="color: #a0522d;">third</span>;

  <span style="color: #a020f0;">if</span> (context == QMCKL_NULL_CONTEXT) {
    <span style="color: #a020f0;">return</span> QMCKL_INVALID_CONTEXT;
  } 

  <span style="color: #a020f0;">if</span> (walk_num &lt;= 0) {
    <span style="color: #a020f0;">return</span> QMCKL_INVALID_ARG_2;
  } 

  <span style="color: #a020f0;">if</span> (elec_num &lt;= 0) {
    <span style="color: #a020f0;">return</span> QMCKL_INVALID_ARG_3;
  }

  <span style="color: #a020f0;">if</span> (bord_num &lt;= 0) {
    <span style="color: #a020f0;">return</span> QMCKL_INVALID_ARG_4;
  }


  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">nw</span> = 0; nw &lt; walk_num; ++nw) {
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">ii</span> = 0; ii &lt; 4; ++ii) {
      <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">j</span> = 0; j &lt; elec_num; ++j) {
        factor_ee_deriv_e[j + ii * elec_num + nw * elec_num * 4]  = 0.0;
      }
    }
  }

  third = 1.0 / 3.0;

  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">nw</span> = 0; nw &lt; walk_num; ++nw) {
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span> = 0; i &lt; elec_num; ++i) {
      <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">j</span> = 0; j &lt; elec_num; ++j) {
        x = ee_distance_rescaled[j + i * elec_num + nw * elec_num * elec_num];
        <span style="color: #a020f0;">if</span> (fabs(x) &lt; 1.0e-18) <span style="color: #a020f0;">continue</span>;
        <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">ii</span> = 0; ii &lt; 3; ++ii){
            pow_ser_g[ii] = 0.0;
        }    
        spin_fact   = 1.0;
        den         = 1.0 + bord_vector[1] * x;
        invden      = 1.0 / den;
        invden2     = invden * invden;
        invden3     = invden2 * invden;
        xinv        = 1.0 / (x + 1.0e-18);

        dx[0] = ee_distance_rescaled_deriv_e[0 \
                                           + j * 4 + i * 4 * elec_num \
                                           + nw * 4 * elec_num * elec_num];
        dx[1] = ee_distance_rescaled_deriv_e[1  \
                                           + j * 4 + i * 4 * elec_num \
                                           + nw * 4 * elec_num * elec_num];
        dx[2] = ee_distance_rescaled_deriv_e[2  \
                                           + j * 4 + i * 4 * elec_num \
                                           + nw * 4 * elec_num * elec_num];
        dx[3] = ee_distance_rescaled_deriv_e[3  \
                                           + j * 4 + i * 4 * elec_num \
                                           + nw * 4 * elec_num * elec_num];

        <span style="color: #a020f0;">if</span>((i &lt;= (up_num-1) &amp;&amp; j &lt;= (up_num-1) ) || (i &gt; (up_num-1) &amp;&amp; j &gt; (up_num-1))) {
          spin_fact = 0.5;
        }

        lap1 = 0.0;
        lap2 = 0.0;
        lap3 = 0.0;
        <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">ii</span> = 0; ii &lt; 3; ++ii) {
          x = ee_distance_rescaled[j + i * elec_num + nw * elec_num * elec_num];
          <span style="color: #a020f0;">if</span> (fabs(x) &lt; 1.0e-18) <span style="color: #a020f0;">continue</span>;
          <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">p</span> = 2; p &lt; bord_num+1; ++p) {
            y = p * bord_vector[(p-1) + 1] * x;
            pow_ser_g[ii] = pow_ser_g[ii] + y * dx[ii];
            lap1 = lap1 + (p - 1) * y * xinv * dx[ii] * dx[ii];
            lap2 = lap2 + y;
            x = x * ee_distance_rescaled[j + i * elec_num + nw * elec_num * elec_num];
          }

          lap3 = lap3 - 2.0 * bord_vector[1] * dx[ii] * dx[ii];

          factor_ee_deriv_e[i  + ii * elec_num  + nw * elec_num * 4 ] +=              \
                                       + spin_fact * bord_vector[0] * dx[ii] * invden2 \
                                       + pow_ser_g[ii] ;
        }

        ii = 3;
        lap2 = lap2 * dx[ii] * third;
        lap3 = lap3 + den * dx[ii];
        lap3 = lap3 * (spin_fact * bord_vector[0] * invden3);
        factor_ee_deriv_e[i + ii*elec_num + nw * elec_num * 4] += lap1 + lap2 + lap3;

      }
    }
  }

  <span style="color: #a020f0;">return</span> QMCKL_SUCCESS;
}
</pre>
</div>


<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_compute_factor_ee_deriv_e_hpc</span> (
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>,
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">walk_num</span>,
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">elec_num</span>,
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">up_num</span>,
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">bord_num</span>,
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">bord_vector</span>,
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">ee_distance_rescaled</span>,
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">ee_distance_rescaled_deriv_e</span>,
  <span style="color: #228b22;">double</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">factor_ee_deriv_e</span> );

</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_compute_factor_ee_deriv_e_doc</span> (
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>,
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">walk_num</span>,
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">elec_num</span>,
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">up_num</span>,
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">bord_num</span>,
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">bord_vector</span>,
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">ee_distance_rescaled</span>,
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">ee_distance_rescaled_deriv_e</span>,
  <span style="color: #228b22;">double</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">factor_ee_deriv_e</span> );
</pre>
</div>


<div class="org-src-container">
<pre class="src src-c">    <span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_compute_factor_ee_deriv_e</span> (
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">walk_num</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">elec_num</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">up_num</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">bord_num</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">bord_vector</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">ee_distance_rescaled</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">ee_distance_rescaled_deriv_e</span>,
      <span style="color: #228b22;">double</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">factor_ee_deriv_e</span> ) {

<span style="color: #483d8b;">      #ifdef</span> HAVE_HPC
      <span style="color: #a020f0;">return</span> qmckl_compute_factor_ee_deriv_e_hpc(context, walk_num, elec_num, up_num, bord_num, bord_vector, ee_distance_rescaled, ee_distance_rescaled_deriv_e, factor_ee_deriv_e ); 
<span style="color: #483d8b;">      #else</span>
      <span style="color: #a020f0;">return</span> qmckl_compute_factor_ee_deriv_e_doc(context, walk_num, elec_num, up_num, bord_num, bord_vector, ee_distance_rescaled, ee_distance_rescaled_deriv_e, factor_ee_deriv_e ); 
<span style="color: #483d8b;">      #endif</span>
}
</pre>
</div>
</div>
</div>
