qmckl_jastrow.html





<div id="outline-container-org9d46ccb" class="outline-4">
<h4 id="org9d46ccb"><span class="section-number-4">3.3.3</span> Test</h4>
<div class="outline-text-4" id="text-3-3-3">
<div class="org-src-container">
<pre class="src src-c">/* <span style="color: #b22222;">Check if Jastrow is properly initialized </span>*/
<span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">qmckl_jastrow_provided</span>(<span style="color: #a0522d;">context</span>));

// <span style="color: #b22222;">calculate factor_ee_deriv_e</span>
<span style="color: #228b22;">double</span> <span style="color: #a0522d;">factor_ee_deriv_e</span>[walk_num][4][elec_num];
rc = qmckl_get_jastrow_factor_ee_deriv_e(context, &amp;(factor_ee_deriv_e[0][0][0]),walk_num*4*elec_num);

// <span style="color: #b22222;">check factor_ee_deriv_e</span>
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">factor_ee_deriv_e</span>[0][0][0]-0.16364894652107934) &lt; 1.e-12);
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">factor_ee_deriv_e</span>[0][1][0]+0.6927548119830084 ) &lt; 1.e-12);
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">factor_ee_deriv_e</span>[0][2][0]-0.073267755223968  ) &lt; 1.e-12);
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">factor_ee_deriv_e</span>[0][3][0]-1.5111672803213185 ) &lt; 1.e-12);
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org08670d6" class="outline-3">
<h3 id="org08670d6"><span class="section-number-3">3.4</span> Electron-nucleus component \(f_{en}\)</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Calculate the electron-electron jastrow component <code>factor_en</code> using the <code>aord_vector</code>
coeffecients and the electron-nucleus rescaled distances <code>en_distance_rescaled</code>.
</p>

<p>
\[
f_{en} = \sum_{i,j<i} \left\{ \frac{ A_0 C_{ij}}{1 - A_1 C_{ij}} + \sum^{nord}_{k}A_k C_{ij}^k \right\}
  \]
</p>
</div>
