org/qmckl_jastrow.org
*** Compute
   :PROPERTIES:
   :Name:     qmckl_compute_factor_en
   :CRetType: qmckl_exit_code
   :FRetType: qmckl_exit_code
   :END:

    #+NAME: qmckl_factor_en_args
    | Variable               | Type                                   | In/Out | Description                |
    |------------------------+----------------------------------------+--------+----------------------------|
    | ~context~              | ~qmckl_context~                        | in     | Global state               |
    | ~walk_num~             | ~int64_t~                              | in     | Number of walkers          |
    | ~elec_num~             | ~int64_t~                              | in     | Number of electrons        |
    | ~nucl_num~             | ~int64_t~                              | in     | Number of nucleii          |
    | ~type_nucl_num~        | ~int64_t~                              | in     | Number of unique nuclei    |
    | ~type_nucl_vector~     | ~int64_t[nucl_num]~                    | in     | IDs of unique nucleii      |
    | ~aord_num~             | ~int64_t~                              | in     | Number of coefficients     |
    | ~aord_vector~          | ~double[aord_num+1][type_nucl_num]~    | in     | List of coefficients       |
    | ~en_distance_rescaled~ | ~double[walk_num][nucl_num][elec_num]~ | in     | Electron-nucleus distances |
    | ~factor_en~            | ~double[walk_num]~                     | out    | Electron-nucleus jastrow   |

    #+begin_src f90 :comments org :tangle (eval f) :noweb yes
integer function qmckl_compute_factor_en_f( &
     context, walk_num, elec_num, nucl_num, type_nucl_num, &
     type_nucl_vector, aord_num, aord_vector, &
     en_distance_rescaled, factor_en) &
     result(info)
  use qmckl
  implicit none
  integer(qmckl_context), intent(in)  :: context
  integer*8             , intent(in)  :: walk_num, elec_num, aord_num, nucl_num, type_nucl_num
  integer*8             , intent(in)  :: type_nucl_vector(nucl_num)
  double precision      , intent(in)  :: aord_vector(aord_num + 1, type_nucl_num)
  double precision      , intent(in)  :: en_distance_rescaled(elec_num, nucl_num, walk_num)
  double precision      , intent(out) :: factor_en(walk_num)

  integer*8 :: i, a, p, nw
  double precision   :: x, power_ser

  info = QMCKL_SUCCESS

  if (context == QMCKL_NULL_CONTEXT) then
     info = QMCKL_INVALID_CONTEXT
     return
  endif

  if (walk_num <= 0) then
     info = QMCKL_INVALID_ARG_2
     return
  endif

  if (elec_num <= 0) then
     info = QMCKL_INVALID_ARG_3
     return
  endif

  if (nucl_num <= 0) then
     info = QMCKL_INVALID_ARG_4
     return
  endif

  if (aord_num <= 0) then
     info = QMCKL_INVALID_ARG_7
     return
  endif

  factor_en = 0.0d0

  do nw =1, walk_num
  do a = 1, nucl_num
     do i = 1, elec_num
        x = en_distance_rescaled(i, a, nw)
        power_ser = 0.0d0

        do p = 2, aord_num
          x = x * en_distance_rescaled(i, a, nw)
          power_ser = power_ser + aord_vector(p + 1, type_nucl_vector(a)) * x
        end do

        factor_en(nw) = factor_en(nw) + aord_vector(1, type_nucl_vector(a)) *  &
                                en_distance_rescaled(i, a, nw) /               &
                                (1.0d0 + aord_vector(2, type_nucl_vector(a)) * &
                                en_distance_rescaled(i, a, nw))                &
                                + power_ser

     end do
  end do
  end do

end function qmckl_compute_factor_en_f
    #+end_src


    #+begin_src c :comments org :tangle (eval c) :noweb yes
qmckl_exit_code qmckl_compute_factor_en (
      const qmckl_context context,
      const int64_t walk_num,
      const int64_t elec_num,
      const int64_t nucl_num,
      const int64_t type_nucl_num,
      const int64_t* type_nucl_vector,
      const int64_t aord_num,
      const double* aord_vector,
      const double* en_distance_rescaled,
      double* const factor_en ) {

  double  x, x1, power_ser;


  if (context == QMCKL_NULL_CONTEXT) {
     return QMCKL_INVALID_CONTEXT;
  }

  if (walk_num <= 0) {
     return QMCKL_INVALID_ARG_2;
  }

  if (elec_num <= 0) {
     return QMCKL_INVALID_ARG_3;
  }

  if (nucl_num <= 0) {
     return QMCKL_INVALID_ARG_4;
  }

  if (type_nucl_num <= 0) {
    return QMCKL_INVALID_ARG_5;
  }

  if (type_nucl_vector == NULL) {
    return QMCKL_INVALID_ARG_6;
  }

  if (aord_num <= 0) {
     return QMCKL_INVALID_ARG_7;
  }

  if (aord_vector == NULL) {
    return QMCKL_INVALID_ARG_8;
  }

  if (en_distance_rescaled == NULL) {
    return QMCKL_INVALID_ARG_9;
  }

  if (factor_en == NULL) {
    return QMCKL_INVALID_ARG_10;
  }


  for (int nw = 0; nw < walk_num; ++nw ) {
    // init array
    factor_en[nw] = 0.0;
    for (int a = 0; a < nucl_num; ++a ) {
      for (int i = 0; i < elec_num; ++i ) {
        // x = ee_distance_rescaled[j * (walk_num * elec_num) + i * (walk_num) + nw];
        x = en_distance_rescaled[i + a * elec_num + nw * (elec_num * nucl_num)];
        x1 = x;
        power_ser = 0.0;

        for (int p = 2; p < aord_num+1; ++p) {
          x = x * x1;
          power_ser = power_ser + aord_vector[(p+1)-1 + (type_nucl_vector[a]-1) * aord_num] * x;
        }

        factor_en[nw] = factor_en[nw] + aord_vector[0 + (type_nucl_vector[a]-1)*aord_num] * x1 / \
                        (1.0 + aord_vector[1 + (type_nucl_vector[a]-1) * aord_num] * x1) + \
                        power_ser;

      }
    }
  }

  return QMCKL_SUCCESS;
}
    #+end_src


#   #+CALL: generate_c_header(table=qmckl_factor_en_args,rettyp=get_value("CRetType"),fname=get_value("Name"))

    #+begin_src c :comments org :tangle (eval h_private_func) :noweb yes :exports none
    qmckl_exit_code qmckl_compute_factor_en (
          const qmckl_context context,
          const int64_t walk_num,
          const int64_t elec_num,
          const int64_t nucl_num,
          const int64_t type_nucl_num,
          const int64_t* type_nucl_vector,
          const int64_t aord_num,
          const double* aord_vector,
          const double* en_distance_rescaled,
          double* const factor_en );
    #+end_src


