qmckl_jastrow.html


<div id="outline-container-orgd6aff7b" class="outline-4">
<h4 id="orgd6aff7b"><span class="section-number-4">3.4.1</span> Get</h4>
<div class="outline-text-4" id="text-3-4-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span>
<span style="color: #0000ff;">qmckl_get_jastrow_factor_en</span>(<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>,
                            <span style="color: #228b22;">double</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">factor_en</span>,
                            <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size_max</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-orge1dfa88" class="outline-4">
<h4 id="orge1dfa88"><span class="section-number-4">3.4.2</span> Compute</h4>
<div class="outline-text-4" id="text-3-4-2">
<table id="orgf16f6e2" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">In/Out</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>context</code></td>
<td class="org-left"><code>qmckl_context</code></td>
<td class="org-left">in</td>
<td class="org-left">Global state</td>
</tr>

<tr>
<td class="org-left"><code>walk_num</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">in</td>
<td class="org-left">Number of walkers</td>
</tr>

<tr>
<td class="org-left"><code>elec_num</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">in</td>
<td class="org-left">Number of electrons</td>
</tr>

<tr>
<td class="org-left"><code>nucl_num</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">in</td>
<td class="org-left">Number of nucleii</td>
</tr>

<tr>
<td class="org-left"><code>type_nucl_num</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">in</td>
<td class="org-left">Number of unique nuclei</td>
</tr>

<tr>
<td class="org-left"><code>type_nucl_vector</code></td>
<td class="org-left"><code>int64_t[nucl_num]</code></td>
<td class="org-left">in</td>
<td class="org-left">IDs of unique nucleii</td>
</tr>

<tr>
<td class="org-left"><code>aord_num</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">in</td>
<td class="org-left">Number of coefficients</td>
</tr>

<tr>
<td class="org-left"><code>aord_vector</code></td>
<td class="org-left"><code>double[aord_num+1][type_nucl_num]</code></td>
<td class="org-left">in</td>
<td class="org-left">List of coefficients</td>
</tr>

<tr>
<td class="org-left"><code>en_distance_rescaled</code></td>
<td class="org-left"><code>double[walk_num][nucl_num][elec_num]</code></td>
<td class="org-left">in</td>
<td class="org-left">Electron-nucleus distances</td>
</tr>

<tr>
<td class="org-left"><code>factor_en</code></td>
<td class="org-left"><code>double[walk_num]</code></td>
<td class="org-left">out</td>
<td class="org-left">Electron-nucleus jastrow</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-f90"><span style="color: #228b22;">integer</span><span style="color: #a0522d;"> function qmckl_compute_factor_en_f( </span><span style="color: #a020f0;">&amp;</span>
     context, walk_num, elec_num, nucl_num, type_nucl_num, <span style="color: #a020f0;">&amp;</span>
     type_nucl_vector, aord_num, aord_vector, <span style="color: #a020f0;">&amp;</span>
     en_distance_rescaled, factor_en) <span style="color: #a020f0;">&amp;</span>
     <span style="color: #a020f0;">result</span>(info)
  <span style="color: #a020f0;">use</span> <span style="color: #0000ff;">qmckl</span>
  <span style="color: #a020f0;">implicit</span> <span style="color: #228b22;">none</span>
  <span style="color: #228b22;">integer</span>(qmckl_context), <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> context</span>
  <span style="color: #228b22;">integer</span>*8             , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> walk_num, elec_num, aord_num, nucl_num, type_nucl_num</span>
  <span style="color: #228b22;">integer</span>*8             , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> type_nucl_vector(nucl_num)</span>
  <span style="color: #228b22;">double precision</span>      , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> aord_vector(aord_num + 1, type_nucl_num)</span>
  <span style="color: #228b22;">double precision</span>      , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> en_distance_rescaled(elec_num, nucl_num, walk_num)</span>
  <span style="color: #228b22;">double precision</span>      , <span style="color: #a020f0;">intent</span>(out) ::<span style="color: #a0522d;"> factor_en(walk_num)</span>

  <span style="color: #228b22;">integer</span>*8 ::<span style="color: #a0522d;"> i, a, p, nw</span>
  <span style="color: #228b22;">double precision</span>   ::<span style="color: #a0522d;"> x, power_ser</span>

  info = QMCKL_SUCCESS

  <span style="color: #a020f0;">if</span> (context == QMCKL_NULL_CONTEXT) <span style="color: #a020f0;">then</span>
     info = QMCKL_INVALID_CONTEXT
     <span style="color: #a020f0;">return</span>
  <span style="color: #a020f0;">endif</span>

  <span style="color: #a020f0;">if</span> (walk_num &lt;= 0) <span style="color: #a020f0;">then</span>
     info = QMCKL_INVALID_ARG_2
     <span style="color: #a020f0;">return</span>
  <span style="color: #a020f0;">endif</span>

  <span style="color: #a020f0;">if</span> (elec_num &lt;= 0) <span style="color: #a020f0;">then</span>
     info = QMCKL_INVALID_ARG_3
     <span style="color: #a020f0;">return</span>
  <span style="color: #a020f0;">endif</span>

  <span style="color: #a020f0;">if</span> (nucl_num &lt;= 0) <span style="color: #a020f0;">then</span>
     info = QMCKL_INVALID_ARG_4
     <span style="color: #a020f0;">return</span>
  <span style="color: #a020f0;">endif</span>

  <span style="color: #a020f0;">if</span> (aord_num &lt;= 0) <span style="color: #a020f0;">then</span>
     info = QMCKL_INVALID_ARG_7
     <span style="color: #a020f0;">return</span>
  <span style="color: #a020f0;">endif</span>

  factor_en = 0.0d0

  <span style="color: #a020f0;">do</span> nw =1, walk_num
  <span style="color: #a020f0;">do</span> a = 1, nucl_num
     <span style="color: #a020f0;">do</span> i = 1, elec_num
        x = en_distance_rescaled(i, a, nw)
        power_ser = 0.0d0

        <span style="color: #a020f0;">do</span> p = 2, aord_num
          x = x * en_distance_rescaled(i, a, nw)
          power_ser = power_ser + aord_vector(p + 1, type_nucl_vector(a)) * x
        <span style="color: #a020f0;">end do</span>

        factor_en(nw) = factor_en(nw) + aord_vector(1, type_nucl_vector(a)) *  <span style="color: #a020f0;">&amp;</span>
                                en_distance_rescaled(i, a, nw) /               <span style="color: #a020f0;">&amp;</span>
                                (1.0d0 + aord_vector(2, type_nucl_vector(a)) * <span style="color: #a020f0;">&amp;</span>
                                en_distance_rescaled(i, a, nw))                <span style="color: #a020f0;">&amp;</span>
                                + power_ser

     <span style="color: #a020f0;">end do</span>
  <span style="color: #a020f0;">end do</span>
  <span style="color: #a020f0;">end do</span>

<span style="color: #a020f0;">end function</span> <span style="color: #0000ff;">qmckl_compute_factor_en_f</span>
</pre>
</div>


<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_compute_factor_en</span> (
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">walk_num</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">elec_num</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">nucl_num</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">type_nucl_num</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span>* <span style="color: #a0522d;">type_nucl_vector</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">aord_num</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">aord_vector</span>,
      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">en_distance_rescaled</span>,
      <span style="color: #228b22;">double</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">factor_en</span> ) {

  <span style="color: #228b22;">double</span>  <span style="color: #a0522d;">x</span>, <span style="color: #a0522d;">x1</span>, <span style="color: #a0522d;">power_ser</span>;


  <span style="color: #a020f0;">if</span> (context == QMCKL_NULL_CONTEXT) {
     <span style="color: #a020f0;">return</span> QMCKL_INVALID_CONTEXT;
  }

  <span style="color: #a020f0;">if</span> (walk_num &lt;= 0) {
     <span style="color: #a020f0;">return</span> QMCKL_INVALID_ARG_2;
  }

  <span style="color: #a020f0;">if</span> (elec_num &lt;= 0) {
     <span style="color: #a020f0;">return</span> QMCKL_INVALID_ARG_3;
  }

  <span style="color: #a020f0;">if</span> (nucl_num &lt;= 0) {
     <span style="color: #a020f0;">return</span> QMCKL_INVALID_ARG_4;
  }

  <span style="color: #a020f0;">if</span> (type_nucl_num &lt;= 0) {
    <span style="color: #a020f0;">return</span> QMCKL_INVALID_ARG_5;
  }

  <span style="color: #a020f0;">if</span> (type_nucl_vector == <span style="color: #008b8b;">NULL</span>) {
    <span style="color: #a020f0;">return</span> QMCKL_INVALID_ARG_6;
  }

  <span style="color: #a020f0;">if</span> (aord_num &lt;= 0) {
     <span style="color: #a020f0;">return</span> QMCKL_INVALID_ARG_7;
  }

  <span style="color: #a020f0;">if</span> (aord_vector == <span style="color: #008b8b;">NULL</span>) {
    <span style="color: #a020f0;">return</span> QMCKL_INVALID_ARG_8;
  }

  <span style="color: #a020f0;">if</span> (en_distance_rescaled == <span style="color: #008b8b;">NULL</span>) {
    <span style="color: #a020f0;">return</span> QMCKL_INVALID_ARG_9;
  }

  <span style="color: #a020f0;">if</span> (factor_en == <span style="color: #008b8b;">NULL</span>) {
    <span style="color: #a020f0;">return</span> QMCKL_INVALID_ARG_10;
  }


  <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">nw</span> = 0; nw &lt; walk_num; ++nw ) {
    // <span style="color: #b22222;">init array</span>
    factor_en[nw] = 0.0;
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">a</span> = 0; a &lt; nucl_num; ++a ) {
      <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span> = 0; i &lt; elec_num; ++i ) {
        // <span style="color: #b22222;">x = ee_distance_rescaled[j * (walk_num * elec_num) + i * (walk_num) + nw];</span>
        x = en_distance_rescaled[i + a * elec_num + nw * (elec_num * nucl_num)];
        x1 = x;
        power_ser = 0.0;

        <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">p</span> = 2; p &lt; aord_num+1; ++p) {
          x = x * x1;
          power_ser = power_ser + aord_vector[(p+1)-1 + (type_nucl_vector[a]-1) * aord_num] * x;
        }

        factor_en[nw] = factor_en[nw] + aord_vector[0 + (type_nucl_vector[a]-1)*aord_num] * x1 / \
                        (1.0 + aord_vector[1 + (type_nucl_vector[a]-1) * aord_num] * x1) + \
                        power_ser;

      }
    }
  }

  <span style="color: #a020f0;">return</span> QMCKL_SUCCESS;
}
</pre>
</div>
</div>
</div>
