qmckl_jastrow.html

<div id="outline-container-org3b1f6f9" class="outline-4">
<h4 id="org3b1f6f9"><span class="section-number-4">3.4.3</span> Test</h4>
<div class="outline-text-4" id="text-3-4-3">
<div class="org-src-container">
<pre class="src src-c">/* <span style="color: #b22222;">Check if Jastrow is properly initialized </span>*/
<span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">qmckl_jastrow_provided</span>(<span style="color: #a0522d;">context</span>));

<span style="color: #228b22;">double</span> <span style="color: #a0522d;">factor_en</span>[walk_num];
rc = qmckl_get_jastrow_factor_en(context, factor_en,walk_num);

// <span style="color: #b22222;">calculate factor_en</span>
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">factor_en</span>[0]+5.865822569188727) &lt; 1.e-12);

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org70afcca" class="outline-3">
<h3 id="org70afcca"><span class="section-number-3">3.5</span> Electron-nucleus component derivative \(f'_{en}\)</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Calculate the electron-electron jastrow component <code>factor_en_deriv_e</code> derivative
with respect to the electron coordinates using the <code>en_distance_rescaled</code> and
<code>en_distance_rescaled_deriv_e</code> which are already calculated previously.
</p>

<p>
TODO: write equations.
</p>
</div>
