qmckl_jastrow.html

<div id="outline-container-orgc456aea" class="outline-4">
<h4 id="orgc456aea"><span class="section-number-4">3.5.3</span> Test</h4>
<div class="outline-text-4" id="text-3-5-3">
<div class="org-src-container">
<pre class="src src-c">/* <span style="color: #b22222;">Check if Jastrow is properly initialized </span>*/
<span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">qmckl_jastrow_provided</span>(<span style="color: #a0522d;">context</span>));

// <span style="color: #b22222;">calculate factor_en_deriv_e</span>
<span style="color: #228b22;">double</span> <span style="color: #a0522d;">factor_en_deriv_e</span>[walk_num][4][elec_num];
rc = qmckl_get_jastrow_factor_en_deriv_e(context, &amp;(factor_en_deriv_e[0][0][0]),walk_num*4*elec_num);

// <span style="color: #b22222;">check factor_en_deriv_e</span>
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">factor_en_deriv_e</span>[0][0][0]-0.11609919541763383) &lt; 1.e-12);
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">factor_en_deriv_e</span>[0][1][0]+0.23301394780804574) &lt; 1.e-12);
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">factor_en_deriv_e</span>[0][2][0]-0.17548337641865783) &lt; 1.e-12);
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">factor_en_deriv_e</span>[0][3][0]+0.9667363412285741 ) &lt; 1.e-12);

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbaf2c92" class="outline-3">
<h3 id="orgbaf2c92"><span class="section-number-3">3.6</span> Electron-electron rescaled distances for each order</h3>
<div class="outline-text-3" id="text-3-6">
<p>
<code>een_rescaled_e</code> stores the table of the rescaled distances between all
pairs of electrons and raised to the power \(p\) defined by <code>cord_num</code>:
</p>

<p>
\[
   C_{ij,p} = \left( 1 - \exp{-\kappa C_{ij}} \right)^p
   \]
</p>

<p>
where \(C_{ij}\) is the matrix of electron-electron distances.
</p>
</div>
