qmckl_jastrow.html


<div id="outline-container-orgadb9fbc" class="outline-4">
<h4 id="orgadb9fbc"><span class="section-number-4">3.6.3</span> Test</h4>
<div class="outline-text-4" id="text-3-6-3">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">qmckl_electron_provided</span>(<span style="color: #a0522d;">context</span>));


<span style="color: #228b22;">double</span> <span style="color: #a0522d;">een_rescaled_e</span>[walk_num][(cord_num + 1)][elec_num][elec_num];
rc = qmckl_get_jastrow_een_rescaled_e(context, &amp;(een_rescaled_e[0][0][0][0]),elec_num*elec_num*(cord_num+1)*walk_num);

// <span style="color: #b22222;">value of (0,2,1)</span>
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">een_rescaled_e</span>[0][1][0][2]-0.08084493981483197)   &lt; 1.e-12);
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">een_rescaled_e</span>[0][1][0][3]-0.1066745707571846)    &lt; 1.e-12);
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">een_rescaled_e</span>[0][1][0][4]-0.01754273169464735)   &lt; 1.e-12);
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">een_rescaled_e</span>[0][2][1][3]-0.02214680362033448)   &lt; 1.e-12);
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">een_rescaled_e</span>[0][2][1][4]-0.0005700154999202759) &lt; 1.e-12);
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">een_rescaled_e</span>[0][2][1][5]-0.3424402276009091)    &lt; 1.e-12);
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org982d851" class="outline-3">
<h3 id="org982d851"><span class="section-number-3">3.7</span> Electron-electron rescaled distances for each order and derivatives</h3>
<div class="outline-text-3" id="text-3-7">
<p>
<code>een_rescaled_e_deriv_e</code> stores the table of the derivatives of the
rescaled distances between all pairs of electrons and raised to the
power \(p\) defined by <code>cord_num</code>.  Here we take its derivatives
required for the een jastrow.
</p>

<p>
TODO: write formulae
</p>
</div>
