qmckl_jastrow.html

<div id="outline-container-orgf767459" class="outline-4">
<h4 id="orgf767459"><span class="section-number-4">3.7.3</span> Test</h4>
<div class="outline-text-4" id="text-3-7-3">
<div class="org-src-container">
<pre class="src src-c">//<span style="color: #b22222;">assert(qmckl_electron_provided(context));</span>
<span style="color: #228b22;">double</span> <span style="color: #a0522d;">een_rescaled_e_deriv_e</span>[walk_num][(cord_num + 1)][elec_num][4][elec_num];
size_max=walk_num*(cord_num + 1)*elec_num*4*elec_num;
rc = qmckl_get_jastrow_een_rescaled_e_deriv_e(context,
          &amp;(een_rescaled_e_deriv_e[0][0][0][0][0]),size_max);

// <span style="color: #b22222;">value of (0,0,0,2,1)</span>
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">een_rescaled_e_deriv_e</span>[0][1][0][0][2] + 0.05991352796887283   ) &lt; 1.e-12);
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">een_rescaled_e_deriv_e</span>[0][1][0][0][3] + 0.011714035071545248  ) &lt; 1.e-12);
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">een_rescaled_e_deriv_e</span>[0][1][0][0][4] + 0.00441398875758468   ) &lt; 1.e-12);
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">een_rescaled_e_deriv_e</span>[0][2][1][0][3] + 0.013553180060167595  ) &lt; 1.e-12);
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">een_rescaled_e_deriv_e</span>[0][2][1][0][4] + 0.00041342909359870457) &lt; 1.e-12);
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">een_rescaled_e_deriv_e</span>[0][2][1][0][5] + 0.5880599146214673    ) &lt; 1.e-12);
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2d7a0b3" class="outline-3">
<h3 id="org2d7a0b3"><span class="section-number-3">3.8</span> Electron-nucleus rescaled distances for each order</h3>
<div class="outline-text-3" id="text-3-8">
<p>
<code>een_rescaled_n</code> stores the table of the rescaled distances between
electrons and nucleii raised to the power \(p\) defined by <code>cord_num</code>:
</p>

<p>
\[
   C_{ia,p} = \left( 1 - \exp{-\kappa C_{ia}} \right)^p
   \]
</p>

<p>
where \(C_{ia}\) is the matrix of electron-nucleus distances.
</p>
</div>
