qmckl_jastrow.html

<div id="outline-container-orgd3bd3f9" class="outline-4">
<h4 id="orgd3bd3f9"><span class="section-number-4">3.8.3</span> Test</h4>
<div class="outline-text-4" id="text-3-8-3">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">qmckl_electron_provided</span>(<span style="color: #a0522d;">context</span>));

<span style="color: #228b22;">double</span> <span style="color: #a0522d;">een_rescaled_n</span>[walk_num][(cord_num + 1)][nucl_num][elec_num];
size_max=walk_num*(cord_num + 1)*nucl_num*elec_num;
rc = qmckl_get_jastrow_een_rescaled_n(context, &amp;(een_rescaled_n[0][0][0][0]),size_max);

// <span style="color: #b22222;">value of (0,2,1)</span>
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">een_rescaled_n</span>[0][1][0][2]-0.10612983920006765)  &lt; 1.e-12);
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">een_rescaled_n</span>[0][1][0][3]-0.135652809635553)    &lt; 1.e-12);
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">een_rescaled_n</span>[0][1][0][4]-0.023391817607642338) &lt; 1.e-12);
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">een_rescaled_n</span>[0][2][1][3]-0.880957224822116)    &lt; 1.e-12);
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">een_rescaled_n</span>[0][2][1][4]-0.027185942659395074) &lt; 1.e-12);
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">een_rescaled_n</span>[0][2][1][5]-0.01343938025140174)  &lt; 1.e-12);
</pre>
</div>
</div>
</div>
</div>
