qmckl_jastrow.html

<div id="outline-container-orgc91cb54" class="outline-4">
<h4 id="orgc91cb54"><span class="section-number-4">3.9.3</span> Test</h4>
<div class="outline-text-4" id="text-3-9-3">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">qmckl_electron_provided</span>(<span style="color: #a0522d;">context</span>));

<span style="color: #228b22;">double</span> <span style="color: #a0522d;">een_rescaled_n_deriv_e</span>[walk_num][(cord_num + 1)][nucl_num][4][elec_num];
size_max=walk_num*(cord_num + 1)*nucl_num*4*elec_num;
rc = qmckl_get_jastrow_een_rescaled_n_deriv_e(context, &amp;(een_rescaled_n_deriv_e[0][0][0][0][0]),size_max);

// <span style="color: #b22222;">value of (0,2,1)</span>
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">een_rescaled_n_deriv_e</span>[0][1][0][0][2]+0.07633444246999128   )  &lt; 1.e-12);
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">een_rescaled_n_deriv_e</span>[0][1][0][0][3]-0.00033282346259738276)  &lt; 1.e-12);
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">een_rescaled_n_deriv_e</span>[0][1][0][0][4]+0.004775370547333061  )  &lt; 1.e-12);
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">een_rescaled_n_deriv_e</span>[0][2][1][0][3]-0.1362654644223866    )  &lt; 1.e-12);
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">een_rescaled_n_deriv_e</span>[0][2][1][0][4]+0.0231253431662794    )  &lt; 1.e-12);
<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">een_rescaled_n_deriv_e</span>[0][2][1][0][5]-0.001593334817691633  )  &lt; 1.e-12);

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org38c0d6c" class="outline-3">
<h3 id="org38c0d6c"><span class="section-number-3">3.10</span> Prepare for electron-electron-nucleus Jastrow \(f_{een}\)</h3>
<div class="outline-text-3" id="text-3-10">
<p>
Prepare <code>cord_vect_full</code> and <code>lkpm_combined_index</code> tables required for the
calculation of the three-body jastrow <code>factor_een</code> and its derivative
<code>factor_een_deriv_e</code>.
</p>
</div>
