org/qmckl_jastrow.org
*** Compute cord_vect_full
   :PROPERTIES:
   :Name:     qmckl_compute_cord_vect_full
   :CRetType: qmckl_exit_code
   :FRetType: qmckl_exit_code
   :END:

    #+NAME: qmckl_factor_cord_vect_full_args
    | Variable           | Type                                   | In/Out | Description                  |
    |--------------------+----------------------------------------+--------+------------------------------|
    | ~context~          | ~qmckl_context~                        | in     | Global state                 |
    | ~nucl_num~         | ~int64_t~                              | in     | Number of atoms              |
    | ~dim_cord_vect~    | ~int64_t~                              | in     | dimension of cord full table |
    | ~type_nucl_num~    | ~int64_t~                              | in     | dimension of cord full table |
    | ~type_nucl_vector~ | ~int64_t[nucl_num]~                    | in     | dimension of cord full table |
    | ~cord_vector~      | ~double[dim_cord_vect][type_nucl_num]~ | in     | dimension of cord full table |
    | ~cord_vect_full~   | ~double[dim_cord_vect][nucl_num]~      | out    | Full list of coefficients    |

    #+begin_src f90 :comments org :tangle (eval f) :noweb yes
integer function qmckl_compute_cord_vect_full_doc_f( &
     context, nucl_num, dim_cord_vect, type_nucl_num,  &
     type_nucl_vector, cord_vector, cord_vect_full) &
     result(info)
  use qmckl
  implicit none
  integer(qmckl_context), intent(in)  :: context
  integer*8             , intent(in)  :: nucl_num
  integer*8             , intent(in)  :: dim_cord_vect
  integer*8             , intent(in)  :: type_nucl_num
  integer*8             , intent(in)  :: type_nucl_vector(nucl_num)
  double precision      , intent(in)  :: cord_vector(type_nucl_num, dim_cord_vect)
  double precision      , intent(out) :: cord_vect_full(nucl_num,dim_cord_vect)
  double precision                    :: x
  integer*8                           :: i, a, k, l, nw

  info = QMCKL_SUCCESS

  if (context == QMCKL_NULL_CONTEXT) then
     info = QMCKL_INVALID_CONTEXT
     return
  endif

  if (nucl_num <= 0) then
     info = QMCKL_INVALID_ARG_2
     return
  endif

  if (type_nucl_num <= 0) then
     info = QMCKL_INVALID_ARG_4
     return
  endif

  if (dim_cord_vect <= 0) then
     info = QMCKL_INVALID_ARG_5
     return
  endif


  do a = 1, nucl_num
    cord_vect_full(a,1:dim_cord_vect) = cord_vector(type_nucl_vector(a),1:dim_cord_vect)
  end do

end function qmckl_compute_cord_vect_full_doc_f
    #+end_src

    #+CALL: generate_c_interface(table=qmckl_factor_cord_vect_full_args,rettyp=get_value("CRetType"),fname="qmckl_compute_cord_vect_full_doc")

    #+RESULTS:
    #+begin_src f90 :tangle (eval f) :comments org :exports none
    integer(c_int32_t) function qmckl_compute_cord_vect_full_doc &
	(context, nucl_num, dim_cord_vect, type_nucl_num, type_nucl_vector, cord_vector, cord_vect_full) &
	bind(C) result(info)

      use, intrinsic :: iso_c_binding
      implicit none

      integer (c_int64_t) , intent(in)  , value :: context
      integer (c_int64_t) , intent(in)  , value :: nucl_num
      integer (c_int64_t) , intent(in)  , value :: dim_cord_vect
      integer (c_int64_t) , intent(in)  , value :: type_nucl_num
      integer (c_int64_t) , intent(in)          :: type_nucl_vector(nucl_num)
      real    (c_double ) , intent(in)          :: cord_vector(type_nucl_num,dim_cord_vect)
      real    (c_double ) , intent(out)         :: cord_vect_full(nucl_num,dim_cord_vect)

      integer(c_int32_t), external :: qmckl_compute_cord_vect_full_doc_f
      info = qmckl_compute_cord_vect_full_doc_f &
	     (context, nucl_num, dim_cord_vect, type_nucl_num, type_nucl_vector, cord_vector, cord_vect_full)

    end function qmckl_compute_cord_vect_full_doc
    #+end_src

    #+begin_src c :comments org :tangle (eval c) :noweb yes
qmckl_exit_code qmckl_compute_cord_vect_full_hpc (
	  const qmckl_context context,
	  const int64_t nucl_num,
	  const int64_t dim_cord_vect,
	  const int64_t type_nucl_num,
	  const int64_t* type_nucl_vector,
	  const double* cord_vector,
	  double* const cord_vect_full ) {

  if (context == QMCKL_NULL_CONTEXT) {
     return QMCKL_INVALID_CONTEXT;
  }

  if (nucl_num <= 0) {
     return QMCKL_INVALID_ARG_2;
  }

  if (type_nucl_num <= 0) {
     return QMCKL_INVALID_ARG_4;
  }

  if (dim_cord_vect <= 0) {
     return QMCKL_INVALID_ARG_5;
  }

  for (int i=0; i < dim_cord_vect; ++i) {
    for (int a=0; a < nucl_num; ++a){
      cord_vect_full[a + i*nucl_num] = cord_vector[(type_nucl_vector[a]-1)+i*type_nucl_num];
    }
  }

  return QMCKL_SUCCESS;
  }
    #+end_src


#   #+CALL: generate_c_header(table=qmckl_factor_cord_vect_full_args,rettyp=get_value("CRetType"),fname="qmckl_compute_cord_vect_full_doc")

    #+begin_src c :comments org :tangle (eval h_private_func) :noweb yes :exports none
    qmckl_exit_code qmckl_compute_cord_vect_full (
	  const qmckl_context context,
	  const int64_t nucl_num,
	  const int64_t dim_cord_vect,
	  const int64_t type_nucl_num,
	  const int64_t* type_nucl_vector,
	  const double* cord_vector,
	  double* const cord_vect_full );
    #+end_src

    #+begin_src c :tangle (eval h_private_func) :comments org
    qmckl_exit_code qmckl_compute_cord_vect_full_doc (
	  const qmckl_context context,
	  const int64_t nucl_num,
	  const int64_t dim_cord_vect,
	  const int64_t type_nucl_num,
	  const int64_t* type_nucl_vector,
	  const double* cord_vector,
	  double* const cord_vect_full );
    #+end_src

    #+begin_src c :tangle (eval h_private_func) :comments org
    qmckl_exit_code qmckl_compute_cord_vect_full_hpc (
	  const qmckl_context context,
	  const int64_t nucl_num,
	  const int64_t dim_cord_vect,
	  const int64_t type_nucl_num,
	  const int64_t* type_nucl_vector,
	  const double* cord_vector,
	  double* const cord_vect_full );
    #+end_src

    #+begin_src c :comments org :tangle (eval c) :noweb yes
qmckl_exit_code qmckl_compute_cord_vect_full (
	  const qmckl_context context,
	  const int64_t nucl_num,
	  const int64_t dim_cord_vect,
	  const int64_t type_nucl_num,
	  const int64_t* type_nucl_vector,
	  const double* cord_vector,
	  double* const cord_vect_full ) {

    #ifdef HAVE_HPC
      return qmckl_compute_cord_vect_full_hpc(context, nucl_num, dim_cord_vect, type_nucl_num, type_nucl_vector, cord_vector, cord_vect_full);
    #else
      return qmckl_compute_cord_vect_full_doc(context, nucl_num, dim_cord_vect, type_nucl_num, type_nucl_vector, cord_vector, cord_vect_full);
    #endif
    }
    #+end_src



