qmckl_jastrow.html

<div id="outline-container-org63f08c1" class="outline-4">
<h4 id="org63f08c1"><span class="section-number-4">3.11.4</span> Test</h4>
<div class="outline-text-4" id="text-3-11-4">
<div class="org-src-container">
<pre class="src src-c">/* <span style="color: #b22222;">Check if Jastrow is properly initialized </span>*/
<span style="color: #0000ff;">assert</span>(<span style="color: #228b22;">qmckl_jastrow_provided</span>(<span style="color: #a0522d;">context</span>));

<span style="color: #228b22;">double</span> <span style="color: #a0522d;">factor_een</span>[walk_num];
rc = qmckl_get_jastrow_factor_een(context, &amp;(factor_een[0]),walk_num);

<span style="color: #0000ff;">assert</span>(fabs(<span style="color: #228b22;">factor_een</span>[0] + 0.37407972141304213) &lt; 1e-12);
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org322ba20" class="outline-3">
<h3 id="org322ba20"><span class="section-number-3">3.12</span> Electron-electron-nucleus Jastrow \(f_{een}\) derivative</h3>
<div class="outline-text-3" id="text-3-12">
<p>
Calculate the electron-electron-nuclear three-body jastrow component <code>factor_een_deriv_e</code>
using the above prepared tables.
</p>

<p>
TODO: write equations.
</p>
</div>
