org/qmckl_jastrow.org
*** Compute Naive
   :PROPERTIES:
   :Name:     qmckl_compute_factor_een_deriv_e_naive
   :CRetType: qmckl_exit_code
   :FRetType: qmckl_exit_code
   :END:

    #+NAME: qmckl_factor_een_deriv_e_naive_args
    | Variable                 | Type                                                  | In/Out | Description                          |
    |--------------------------+-------------------------------------------------------+--------+--------------------------------------|
    | ~context~                | ~qmckl_context~                                       | in     | Global state                         |
    | ~walk_num~               | ~int64_t~                                             | in     | Number of walkers                    |
    | ~elec_num~               | ~int64_t~                                             | in     | Number of electrons                  |
    | ~nucl_num~               | ~int64_t~                                             | in     | Number of nucleii                    |
    | ~cord_num~               | ~int64_t~                                             | in     | order of polynomials                 |
    | ~dim_cord_vect~          | ~int64_t~                                             | in     | dimension of full coefficient vector |
    | ~cord_vect_full~         | ~double[dim_cord_vect][nucl_num]~                     | in     | full coefficient vector              |
    | ~lkpm_combined_index~    | ~int64_t[4][dim_cord_vect]~                           | in     | combined indices                     |
    | ~een_rescaled_e~         | ~double[walk_num][elec_num][elec_num][0:cord_num]~    | in     | Electron-nucleus rescaled            |
    | ~een_rescaled_n~         | ~double[walk_num][elec_num][nucl_num][0:cord_num]~    | in     | Electron-nucleus rescaled factor     |
    | ~een_rescaled_e_deriv_e~ | ~double[walk_num][elec_num][4][elec_num][0:cord_num]~ | in     | Electron-nucleus rescaled            |
    | ~een_rescaled_n_deriv_e~ | ~double[walk_num][elec_num][4][nucl_num][0:cord_num]~ | in     | Electron-nucleus rescaled factor     |
    | ~factor_een_deriv_e~     | ~double[walk_num][4][elec_num]~                       | out    | Electron-nucleus jastrow             |

    #+begin_src f90 :comments org :tangle (eval f) :noweb yes
integer function qmckl_compute_factor_een_deriv_e_naive_f( &
     context, walk_num, elec_num, nucl_num, cord_num, dim_cord_vect, &
     cord_vect_full, lkpm_combined_index, een_rescaled_e, een_rescaled_n, &
     een_rescaled_e_deriv_e, een_rescaled_n_deriv_e, factor_een_deriv_e)&
     result(info)
  use qmckl
  implicit none
  integer(qmckl_context), intent(in)  :: context
  integer*8             , intent(in)  :: walk_num, elec_num, cord_num, nucl_num, dim_cord_vect
  integer*8             , intent(in)  :: lkpm_combined_index(dim_cord_vect, 4)
  double precision      , intent(in)  :: cord_vect_full(nucl_num, dim_cord_vect)
  double precision      , intent(in)  :: een_rescaled_e(0:cord_num, elec_num, elec_num, walk_num)
  double precision      , intent(in)  :: een_rescaled_n(0:cord_num, nucl_num, elec_num, walk_num)
  double precision      , intent(in)  :: een_rescaled_e_deriv_e(0:cord_num, elec_num, 4, elec_num, walk_num)
  double precision      , intent(in)  :: een_rescaled_n_deriv_e(0:cord_num, nucl_num, 4, elec_num, walk_num)
  double precision      , intent(out) :: factor_een_deriv_e(elec_num, 4, walk_num)

  integer*8 :: i, a, j, l, k, p, m, n, nw
  double precision :: accu, accu2, cn
  double precision :: daccu(1:4), daccu2(1:4)

  info = QMCKL_SUCCESS

  if (context == QMCKL_NULL_CONTEXT) then
     info = QMCKL_INVALID_CONTEXT
     return
  endif

  if (walk_num <= 0) then
     info = QMCKL_INVALID_ARG_2
     return
  endif

  if (elec_num <= 0) then
     info = QMCKL_INVALID_ARG_3
     return
  endif

  if (nucl_num <= 0) then
     info = QMCKL_INVALID_ARG_4
     return
  endif

  if (cord_num <= 0) then
     info = QMCKL_INVALID_ARG_5
     return
  endif

  factor_een_deriv_e = 0.0d0

  do nw =1, walk_num
  do n = 1, dim_cord_vect
    l = lkpm_combined_index(n, 1)
    k = lkpm_combined_index(n, 2)
    p = lkpm_combined_index(n, 3)
    m = lkpm_combined_index(n, 4)

    do a = 1, nucl_num
      cn = cord_vect_full(a, n)
      do j = 1, elec_num
        accu = 0.0d0
        accu2 = 0.0d0
        daccu = 0.0d0
        daccu2 = 0.0d0
        do i = 1, elec_num
          accu = accu + een_rescaled_e(k, i, j, nw) *         &
                        een_rescaled_n(m, a, i, nw)
          accu2 = accu2 + een_rescaled_e(k, i, j, nw) *       &
                          een_rescaled_n(m + l, a, i, nw)
          daccu(1:4) = daccu(1:4) + een_rescaled_e_deriv_e(k, j, 1:4, i, nw) *         &
                                    een_rescaled_n(m, a, i, nw)
          daccu2(1:4) = daccu2(1:4) + een_rescaled_e_deriv_e(k, j, 1:4, i, nw) *       &
                                      een_rescaled_n(m + l, a, i, nw)
        end do
        factor_een_deriv_e(j, 1:4, nw) = factor_een_deriv_e(j, 1:4, nw) +              &
               (accu * een_rescaled_n_deriv_e(m + l, a, 1:4, j, nw)                    &
                + daccu(1:4) * een_rescaled_n(m + l, a, j, nw)                         &
                + daccu2(1:4) * een_rescaled_n(m, a, j, nw)                            &
                + accu2 * een_rescaled_n_deriv_e(m, a, 1:4, j, nw)) * cn

        factor_een_deriv_e(j, 4, nw) = factor_een_deriv_e(j, 4, nw) + 2.0d0 * (        &
            daccu (1) * een_rescaled_n_deriv_e(m + l, a, 1, j, nw) +                    &
            daccu (2) * een_rescaled_n_deriv_e(m + l, a, 2, j, nw) +                    &
            daccu (3) * een_rescaled_n_deriv_e(m + l, a, 3, j, nw) +                    &
            daccu2(1) * een_rescaled_n_deriv_e(m, a, 1, j, nw    ) +                    &
            daccu2(2) * een_rescaled_n_deriv_e(m, a, 2, j, nw    ) +                    &
            daccu2(3) * een_rescaled_n_deriv_e(m, a, 3, j, nw    ) ) * cn

      end do
    end do
  end do
  end do

end function qmckl_compute_factor_een_deriv_e_naive_f
    #+end_src

#   #+CALL: generate_c_header(table=qmckl_factor_een_deriv_e_naive_args,rettyp=get_value("CRetType"),fname=get_value("Name"))

    #+begin_src c :comments org :tangle (eval h_private_func) :noweb yes :exports none
    qmckl_exit_code qmckl_compute_factor_een_deriv_e_naive (
      const qmckl_context context,
      const int64_t walk_num,
      const int64_t elec_num,
      const int64_t nucl_num,
      const int64_t cord_num,
      const int64_t dim_cord_vect,
      const double* cord_vect_full,
      const int64_t* lkpm_combined_index,
      const double* een_rescaled_e,
      const double* een_rescaled_n,
      const double* een_rescaled_e_deriv_e,
      const double* een_rescaled_n_deriv_e,
      double* const factor_een_deriv_e );
    #+end_src


    #+CALL: generate_c_interface(table=qmckl_factor_een_deriv_e_naive_args,rettyp=get_value("CRetType"),fname=get_value("Name"))

    #+RESULTS:
    #+begin_src f90 :tangle (eval f) :comments org :exports none
    integer(c_int32_t) function qmckl_compute_factor_een_deriv_e_naive &
    (context, &
         walk_num, &
         elec_num, &
         nucl_num, &
         cord_num, &
         dim_cord_vect, &
         cord_vect_full, &
         lkpm_combined_index, &
         een_rescaled_e, &
         een_rescaled_n, &
         een_rescaled_e_deriv_e, &
         een_rescaled_n_deriv_e, &
         factor_een_deriv_e) &
    bind(C) result(info)

      use, intrinsic :: iso_c_binding
      implicit none

      integer (c_int64_t) , intent(in)  , value :: context
      integer (c_int64_t) , intent(in)  , value :: walk_num
      integer (c_int64_t) , intent(in)  , value :: elec_num
      integer (c_int64_t) , intent(in)  , value :: nucl_num
      integer (c_int64_t) , intent(in)  , value :: cord_num
      integer (c_int64_t) , intent(in)  , value :: dim_cord_vect
      real    (c_double ) , intent(in)          :: cord_vect_full(nucl_num,dim_cord_vect)
      integer (c_int64_t) , intent(in)          :: lkpm_combined_index(dim_cord_vect,4)
      real    (c_double ) , intent(in)          :: een_rescaled_e(0:cord_num,elec_num,elec_num,walk_num)
      real    (c_double ) , intent(in)          :: een_rescaled_n(0:cord_num,nucl_num,elec_num,walk_num)
      real    (c_double ) , intent(in)          :: een_rescaled_e_deriv_e(0:cord_num,elec_num,4,elec_num,walk_num)
      real    (c_double ) , intent(in)          :: een_rescaled_n_deriv_e(0:cord_num,nucl_num,4,elec_num,walk_num)
      real    (c_double ) , intent(out)         :: factor_een_deriv_e(elec_num,4,walk_num)

      integer(c_int32_t), external :: qmckl_compute_factor_een_deriv_e_naive_f
      info = qmckl_compute_factor_een_deriv_e_naive_f &
         (context, &
         walk_num, &
         elec_num, &
         nucl_num, &
         cord_num, &
         dim_cord_vect, &
         cord_vect_full, &
         lkpm_combined_index, &
         een_rescaled_e, &
         een_rescaled_n, &
         een_rescaled_e_deriv_e, &
         een_rescaled_n_deriv_e, &
         factor_een_deriv_e)

    end function qmckl_compute_factor_een_deriv_e_naive
    #+end_src

