qmckl_jastrow.html

<div id="outline-container-orgea9871d" class="outline-4">
<h4 id="orgea9871d"><span class="section-number-4">3.12.1</span> Get</h4>
<div class="outline-text-4" id="text-3-12-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span>
<span style="color: #0000ff;">qmckl_get_jastrow_factor_een_deriv_e</span>(<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>,
                                     <span style="color: #228b22;">double</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">factor_een_deriv_e</span>,
                                     <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size_max</span>);
</pre>
</div>
</div>
</div>

<div id="outline-container-org3564e43" class="outline-4">
<h4 id="org3564e43"><span class="section-number-4">3.12.2</span> Compute Naive</h4>
<div class="outline-text-4" id="text-3-12-2">
<table id="orge108f50" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">In/Out</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>context</code></td>
<td class="org-left"><code>qmckl_context</code></td>
<td class="org-left">in</td>
<td class="org-left">Global state</td>
</tr>

<tr>
<td class="org-left"><code>walk_num</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">in</td>
<td class="org-left">Number of walkers</td>
</tr>

<tr>
<td class="org-left"><code>elec_num</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">in</td>
<td class="org-left">Number of electrons</td>
</tr>

<tr>
<td class="org-left"><code>nucl_num</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">in</td>
<td class="org-left">Number of nucleii</td>
</tr>

<tr>
<td class="org-left"><code>cord_num</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">in</td>
<td class="org-left">order of polynomials</td>
</tr>

<tr>
<td class="org-left"><code>dim_cord_vect</code></td>
<td class="org-left"><code>int64_t</code></td>
<td class="org-left">in</td>
<td class="org-left">dimension of full coefficient vector</td>
</tr>

<tr>
<td class="org-left"><code>cord_vect_full</code></td>
<td class="org-left"><code>double[dim_cord_vect][nucl_num]</code></td>
<td class="org-left">in</td>
<td class="org-left">full coefficient vector</td>
</tr>

<tr>
<td class="org-left"><code>lkpm_combined_index</code></td>
<td class="org-left"><code>int64_t[4][dim_cord_vect]</code></td>
<td class="org-left">in</td>
<td class="org-left">combined indices</td>
</tr>

<tr>
<td class="org-left"><code>een_rescaled_e</code></td>
<td class="org-left"><code>double[walk_num][elec_num][elec_num][0:cord_num]</code></td>
<td class="org-left">in</td>
<td class="org-left">Electron-nucleus rescaled</td>
</tr>

<tr>
<td class="org-left"><code>een_rescaled_n</code></td>
<td class="org-left"><code>double[walk_num][elec_num][nucl_num][0:cord_num]</code></td>
<td class="org-left">in</td>
<td class="org-left">Electron-nucleus rescaled factor</td>
</tr>

<tr>
<td class="org-left"><code>een_rescaled_e_deriv_e</code></td>
<td class="org-left"><code>double[walk_num][elec_num][4][elec_num][0:cord_num]</code></td>
<td class="org-left">in</td>
<td class="org-left">Electron-nucleus rescaled</td>
</tr>

<tr>
<td class="org-left"><code>een_rescaled_n_deriv_e</code></td>
<td class="org-left"><code>double[walk_num][elec_num][4][nucl_num][0:cord_num]</code></td>
<td class="org-left">in</td>
<td class="org-left">Electron-nucleus rescaled factor</td>
</tr>

<tr>
<td class="org-left"><code>factor_een_deriv_e</code></td>
<td class="org-left"><code>double[walk_num][4][elec_num]</code></td>
<td class="org-left">out</td>
<td class="org-left">Electron-nucleus jastrow</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-f90"><span style="color: #228b22;">integer</span><span style="color: #a0522d;"> function qmckl_compute_factor_een_deriv_e_naive_f( </span><span style="color: #a020f0;">&amp;</span>
     context, walk_num, elec_num, nucl_num, cord_num, dim_cord_vect, <span style="color: #a020f0;">&amp;</span>
     cord_vect_full, lkpm_combined_index, een_rescaled_e, een_rescaled_n, <span style="color: #a020f0;">&amp;</span>
     een_rescaled_e_deriv_e, een_rescaled_n_deriv_e, factor_een_deriv_e)<span style="color: #a020f0;">&amp;</span>
     <span style="color: #a020f0;">result</span>(info)
  <span style="color: #a020f0;">use</span> <span style="color: #0000ff;">qmckl</span>
  <span style="color: #a020f0;">implicit</span> <span style="color: #228b22;">none</span>
  <span style="color: #228b22;">integer</span>(qmckl_context), <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> context</span>
  <span style="color: #228b22;">integer</span>*8             , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> walk_num, elec_num, cord_num, nucl_num, dim_cord_vect</span>
  <span style="color: #228b22;">integer</span>*8             , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> lkpm_combined_index(dim_cord_vect, 4)</span>
  <span style="color: #228b22;">double precision</span>      , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> cord_vect_full(nucl_num, dim_cord_vect)</span>
  <span style="color: #228b22;">double precision</span>      , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> een_rescaled_e(0:cord_num, elec_num, elec_num, walk_num)</span>
  <span style="color: #228b22;">double precision</span>      , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> een_rescaled_n(0:cord_num, nucl_num, elec_num, walk_num)</span>
  <span style="color: #228b22;">double precision</span>      , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> een_rescaled_e_deriv_e(0:cord_num, elec_num, 4, elec_num, walk_num)</span>
  <span style="color: #228b22;">double precision</span>      , <span style="color: #a020f0;">intent</span>(in)  ::<span style="color: #a0522d;"> een_rescaled_n_deriv_e(0:cord_num, nucl_num, 4, elec_num, walk_num)</span>
  <span style="color: #228b22;">double precision</span>      , <span style="color: #a020f0;">intent</span>(out) ::<span style="color: #a0522d;"> factor_een_deriv_e(elec_num, 4, walk_num)</span>

  <span style="color: #228b22;">integer</span>*8 ::<span style="color: #a0522d;"> i, a, j, l, k, p, m, n, nw</span>
  <span style="color: #228b22;">double precision</span> ::<span style="color: #a0522d;"> accu, accu2, cn</span>
  <span style="color: #228b22;">double precision</span> ::<span style="color: #a0522d;"> daccu(1:4), daccu2(1:4)</span>

  info = QMCKL_SUCCESS

  <span style="color: #a020f0;">if</span> (context == QMCKL_NULL_CONTEXT) <span style="color: #a020f0;">then</span>
     info = QMCKL_INVALID_CONTEXT
     <span style="color: #a020f0;">return</span>
  <span style="color: #a020f0;">endif</span>

  <span style="color: #a020f0;">if</span> (walk_num &lt;= 0) <span style="color: #a020f0;">then</span>
     info = QMCKL_INVALID_ARG_2
     <span style="color: #a020f0;">return</span>
  <span style="color: #a020f0;">endif</span>

  <span style="color: #a020f0;">if</span> (elec_num &lt;= 0) <span style="color: #a020f0;">then</span>
     info = QMCKL_INVALID_ARG_3
     <span style="color: #a020f0;">return</span>
  <span style="color: #a020f0;">endif</span>

  <span style="color: #a020f0;">if</span> (nucl_num &lt;= 0) <span style="color: #a020f0;">then</span>
     info = QMCKL_INVALID_ARG_4
     <span style="color: #a020f0;">return</span>
  <span style="color: #a020f0;">endif</span>

  <span style="color: #a020f0;">if</span> (cord_num &lt;= 0) <span style="color: #a020f0;">then</span>
     info = QMCKL_INVALID_ARG_5
     <span style="color: #a020f0;">return</span>
  <span style="color: #a020f0;">endif</span>

  factor_een_deriv_e = 0.0d0

  <span style="color: #a020f0;">do</span> nw =1, walk_num
  <span style="color: #a020f0;">do</span> n = 1, dim_cord_vect
    l = lkpm_combined_index(n, 1)
    k = lkpm_combined_index(n, 2)
    p = lkpm_combined_index(n, 3)
    m = lkpm_combined_index(n, 4)

    <span style="color: #a020f0;">do</span> a = 1, nucl_num
      cn = cord_vect_full(a, n)
      <span style="color: #a020f0;">do</span> j = 1, elec_num
        accu = 0.0d0
        accu2 = 0.0d0
        daccu = 0.0d0
        daccu2 = 0.0d0
        <span style="color: #a020f0;">do</span> i = 1, elec_num
          accu = accu + een_rescaled_e(k, i, j, nw) *         <span style="color: #a020f0;">&amp;</span>
                        een_rescaled_n(m, a, i, nw)
          accu2 = accu2 + een_rescaled_e(k, i, j, nw) *       <span style="color: #a020f0;">&amp;</span>
                          een_rescaled_n(m + l, a, i, nw)
          daccu(1:4) = daccu(1:4) + een_rescaled_e_deriv_e(k, j, 1:4, i, nw) *         <span style="color: #a020f0;">&amp;</span>
                                    een_rescaled_n(m, a, i, nw)
          daccu2(1:4) = daccu2(1:4) + een_rescaled_e_deriv_e(k, j, 1:4, i, nw) *       <span style="color: #a020f0;">&amp;</span>
                                      een_rescaled_n(m + l, a, i, nw)
        <span style="color: #a020f0;">end do</span>
        factor_een_deriv_e(j, 1:4, nw) = factor_een_deriv_e(j, 1:4, nw) +              <span style="color: #a020f0;">&amp;</span>
               (accu * een_rescaled_n_deriv_e(m + l, a, 1:4, j, nw)                    <span style="color: #a020f0;">&amp;</span>
                + daccu(1:4) * een_rescaled_n(m + l, a, j, nw)                         <span style="color: #a020f0;">&amp;</span>
                + daccu2(1:4) * een_rescaled_n(m, a, j, nw)                            <span style="color: #a020f0;">&amp;</span>
                + accu2 * een_rescaled_n_deriv_e(m, a, 1:4, j, nw)) * cn

        factor_een_deriv_e(j, 4, nw) = factor_een_deriv_e(j, 4, nw) + 2.0d0 * (        <span style="color: #a020f0;">&amp;</span>
            daccu (1) * een_rescaled_n_deriv_e(m + l, a, 1, j, nw) +                    <span style="color: #a020f0;">&amp;</span>
            daccu (2) * een_rescaled_n_deriv_e(m + l, a, 2, j, nw) +                    <span style="color: #a020f0;">&amp;</span>
            daccu (3) * een_rescaled_n_deriv_e(m + l, a, 3, j, nw) +                    <span style="color: #a020f0;">&amp;</span>
            daccu2(1) * een_rescaled_n_deriv_e(m, a, 1, j, nw    ) +                    <span style="color: #a020f0;">&amp;</span>
            daccu2(2) * een_rescaled_n_deriv_e(m, a, 2, j, nw    ) +                    <span style="color: #a020f0;">&amp;</span>
            daccu2(3) * een_rescaled_n_deriv_e(m, a, 3, j, nw    ) ) * cn

      <span style="color: #a020f0;">end do</span>
    <span style="color: #a020f0;">end do</span>
  <span style="color: #a020f0;">end do</span>
  <span style="color: #a020f0;">end do</span>

<span style="color: #a020f0;">end function</span> <span style="color: #0000ff;">qmckl_compute_factor_een_deriv_e_naive_f</span>
</pre>
</div>
</div>
</div>
